contiki-os/contiki/cpu/stm32w108/hal/micro/cortexm3/stm32w108/regs.h
#define GAIN_SETTING_0                                       *((volatile int32u *)0x40001074u)
#define GAIN_SETTING_0_REG                                   *((volatile int32u *)0x40001074u)
#define GAIN_SETTING_0_ADDR                                  (0x40001074u)
#define GAIN_SETTING_0_RESET                                 (0x00000000u)
        /* RX_MIXER_GAIN_0 field */
        #define GAIN_SETTING_0_RX_MIXER_GAIN_0               (0x00000040u)
        #define GAIN_SETTING_0_RX_MIXER_GAIN_0_MASK          (0x00000040u)
        #define GAIN_SETTING_0_RX_MIXER_GAIN_0_BIT           (6)
        #define GAIN_SETTING_0_RX_MIXER_GAIN_0_BITS          (1)
        /* RX_FILTER_GAIN_0 field */
        #define GAIN_SETTING_0_RX_FILTER_GAIN_0              (0x00000030u)
        #define GAIN_SETTING_0_RX_FILTER_GAIN_0_MASK         (0x00000030u)
        #define GAIN_SETTING_0_RX_FILTER_GAIN_0_BIT          (4)
        #define GAIN_SETTING_0_RX_FILTER_GAIN_0_BITS         (2)
        /* RX_IF_GAIN_0 field */
        #define GAIN_SETTING_0_RX_IF_GAIN_0                  (0x0000000Fu)
        #define GAIN_SETTING_0_RX_IF_GAIN_0_MASK             (0x0000000Fu)
        #define GAIN_SETTING_0_RX_IF_GAIN_0_BIT              (0)
        #define GAIN_SETTING_0_RX_IF_GAIN_0_BITS             (4)

#define GAIN_SETTING_1                                       *((volatile int32u *)0x40001078u)
#define GAIN_SETTING_1_REG                                   *((volatile int32u *)0x40001078u)
#define GAIN_SETTING_1_ADDR                                  (0x40001078u)
#define GAIN_SETTING_1_RESET                                 (0x00000010u)
        /* RX_MIXER_GAIN_1 field */
        #define GAIN_SETTING_1_RX_MIXER_GAIN_1               (0x00000040u)
        #define GAIN_SETTING_1_RX_MIXER_GAIN_1_MASK          (0x00000040u)
        #define GAIN_SETTING_1_RX_MIXER_GAIN_1_BIT           (6)
        #define GAIN_SETTING_1_RX_MIXER_GAIN_1_BITS          (1)
        /* RX_FILTER_GAIN_1 field */
        #define GAIN_SETTING_1_RX_FILTER_GAIN_1              (0x00000030u)
        #define GAIN_SETTING_1_RX_FILTER_GAIN_1_MASK         (0x00000030u)
        #define GAIN_SETTING_1_RX_FILTER_GAIN_1_BIT          (4)
        #define GAIN_SETTING_1_RX_FILTER_GAIN_1_BITS         (2)
        /* RX_IF_GAIN_1 field */
        #define GAIN_SETTING_1_RX_IF_GAIN_1                  (0x0000000Fu)
        #define GAIN_SETTING_1_RX_IF_GAIN_1_MASK             (0x0000000Fu)
        #define GAIN_SETTING_1_RX_IF_GAIN_1_BIT              (0)
        #define GAIN_SETTING_1_RX_IF_GAIN_1_BITS             (4)

#define GAIN_SETTING_2                                       *((volatile int32u *)0x4000107Cu)
#define GAIN_SETTING_2_REG                                   *((volatile int32u *)0x4000107Cu)
#define GAIN_SETTING_2_ADDR                                  (0x4000107Cu)
#define GAIN_SETTING_2_RESET                                 (0x00000030u)
        /* RX_MIXER_GAIN_2 field */
        #define GAIN_SETTING_2_RX_MIXER_GAIN_2               (0x00000040u)
        #define GAIN_SETTING_2_RX_MIXER_GAIN_2_MASK          (0x00000040u)
        #define GAIN_SETTING_2_RX_MIXER_GAIN_2_BIT           (6)
        #define GAIN_SETTING_2_RX_MIXER_GAIN_2_BITS          (1)
        /* RX_FILTER_GAIN_2 field */
        #define GAIN_SETTING_2_RX_FILTER_GAIN_2              (0x00000030u)
        #define GAIN_SETTING_2_RX_FILTER_GAIN_2_MASK         (0x00000030u)
        #define GAIN_SETTING_2_RX_FILTER_GAIN_2_BIT          (4)
        #define GAIN_SETTING_2_RX_FILTER_GAIN_2_BITS         (2)
        /* RX_IF_GAIN_2 field */
        #define GAIN_SETTING_2_RX_IF_GAIN_2                  (0x0000000Fu)
        #define GAIN_SETTING_2_RX_IF_GAIN_2_MASK             (0x0000000Fu)
        #define GAIN_SETTING_2_RX_IF_GAIN_2_BIT              (0)
        #define GAIN_SETTING_2_RX_IF_GAIN_2_BITS             (4)

#define GAIN_SETTING_3                                       *((volatile int32u *)0x40001080u)
#define GAIN_SETTING_3_REG                                   *((volatile int32u *)0x40001080u)
#define GAIN_SETTING_3_ADDR                                  (0x40001080u)
#define GAIN_SETTING_3_RESET                                 (0x00000031u)
        /* RX_MIXER_GAIN_3 field */
        #define GAIN_SETTING_3_RX_MIXER_GAIN_3               (0x00000040u)
        #define GAIN_SETTING_3_RX_MIXER_GAIN_3_MASK          (0x00000040u)
        #define GAIN_SETTING_3_RX_MIXER_GAIN_3_BIT           (6)
        #define GAIN_SETTING_3_RX_MIXER_GAIN_3_BITS          (1)
        /* RX_FILTER_GAIN_3 field */
        #define GAIN_SETTING_3_RX_FILTER_GAIN_3              (0x00000030u)
        #define GAIN_SETTING_3_RX_FILTER_GAIN_3_MASK         (0x00000030u)
        #define GAIN_SETTING_3_RX_FILTER_GAIN_3_BIT          (4)
        #define GAIN_SETTING_3_RX_FILTER_GAIN_3_BITS         (2)
        /* RX_IF_GAIN_3 field */
        #define GAIN_SETTING_3_RX_IF_GAIN_3                  (0x0000000Fu)
        #define GAIN_SETTING_3_RX_IF_GAIN_3_MASK             (0x0000000Fu)
        #define GAIN_SETTING_3_RX_IF_GAIN_3_BIT              (0)
        #define GAIN_SETTING_3_RX_IF_GAIN_3_BITS             (4)

#define GAIN_SETTING_4                                       *((volatile int32u *)0x40001084u)
#define GAIN_SETTING_4_REG                                   *((volatile int32u *)0x40001084u)
#define GAIN_SETTING_4_ADDR                                  (0x40001084u)
#define GAIN_SETTING_4_RESET                                 (0x00000032u)
        /* RX_MIXER_GAIN_4 field */
        #define GAIN_SETTING_4_RX_MIXER_GAIN_4               (0x00000040u)
        #define GAIN_SETTING_4_RX_MIXER_GAIN_4_MASK          (0x00000040u)
        #define GAIN_SETTING_4_RX_MIXER_GAIN_4_BIT           (6)
        #define GAIN_SETTING_4_RX_MIXER_GAIN_4_BITS          (1)
        /* RX_FILTER_GAIN_4 field */
        #define GAIN_SETTING_4_RX_FILTER_GAIN_4              (0x00000030u)
        #define GAIN_SETTING_4_RX_FILTER_GAIN_4_MASK         (0x00000030u)
        #define GAIN_SETTING_4_RX_FILTER_GAIN_4_BIT          (4)
        #define GAIN_SETTING_4_RX_FILTER_GAIN_4_BITS         (2)
        /* RX_IF_GAIN_4 field */
        #define GAIN_SETTING_4_RX_IF_GAIN_4                  (0x0000000Fu)
        #define GAIN_SETTING_4_RX_IF_GAIN_4_MASK             (0x0000000Fu)
        #define GAIN_SETTING_4_RX_IF_GAIN_4_BIT              (0)
        #define GAIN_SETTING_4_RX_IF_GAIN_4_BITS             (4)

#define GAIN_SETTING_5                                       *((volatile int32u *)0x40001088u)
#define GAIN_SETTING_5_REG                                   *((volatile int32u *)0x40001088u)
#define GAIN_SETTING_5_ADDR                                  (0x40001088u)
#define GAIN_SETTING_5_RESET                                 (0x00000033u)
        /* RX_MIXER_GAIN_5 field */
        #define GAIN_SETTING_5_RX_MIXER_GAIN_5               (0x00000040u)
        #define GAIN_SETTING_5_RX_MIXER_GAIN_5_MASK          (0x00000040u)
        #define GAIN_SETTING_5_RX_MIXER_GAIN_5_BIT           (6)
        #define GAIN_SETTING_5_RX_MIXER_GAIN_5_BITS          (1)
        /* RX_FILTER_GAIN_5 field */
        #define GAIN_SETTING_5_RX_FILTER_GAIN_5              (0x00000030u)
        #define GAIN_SETTING_5_RX_FILTER_GAIN_5_MASK         (0x00000030u)
        #define GAIN_SETTING_5_RX_FILTER_GAIN_5_BIT          (4)
        #define GAIN_SETTING_5_RX_FILTER_GAIN_5_BITS         (2)
        /* RX_IF_GAIN_5 field */
        #define GAIN_SETTING_5_RX_IF_GAIN_5                  (0x0000000Fu)
        #define GAIN_SETTING_5_RX_IF_GAIN_5_MASK             (0x0000000Fu)
        #define GAIN_SETTING_5_RX_IF_GAIN_5_BIT              (0)
        #define GAIN_SETTING_5_RX_IF_GAIN_5_BITS             (4)

