contiki-os/contiki/cpu/stm32w108/hal/micro/cortexm3/stm32w108/regs.h
#define GAIN_SETTING_6                                       *((volatile int32u *)0x4000108Cu)
#define GAIN_SETTING_6_REG                                   *((volatile int32u *)0x4000108Cu)
#define GAIN_SETTING_6_ADDR                                  (0x4000108Cu)
#define GAIN_SETTING_6_RESET                                 (0x00000034u)
        /* RX_MIXER_GAIN_6 field */
        #define GAIN_SETTING_6_RX_MIXER_GAIN_6               (0x00000040u)
        #define GAIN_SETTING_6_RX_MIXER_GAIN_6_MASK          (0x00000040u)
        #define GAIN_SETTING_6_RX_MIXER_GAIN_6_BIT           (6)
        #define GAIN_SETTING_6_RX_MIXER_GAIN_6_BITS          (1)
        /* RX_FILTER_GAIN_6 field */
        #define GAIN_SETTING_6_RX_FILTER_GAIN_6              (0x00000030u)
        #define GAIN_SETTING_6_RX_FILTER_GAIN_6_MASK         (0x00000030u)
        #define GAIN_SETTING_6_RX_FILTER_GAIN_6_BIT          (4)
        #define GAIN_SETTING_6_RX_FILTER_GAIN_6_BITS         (2)
        /* RX_IF_GAIN_6 field */
        #define GAIN_SETTING_6_RX_IF_GAIN_6                  (0x0000000Fu)
        #define GAIN_SETTING_6_RX_IF_GAIN_6_MASK             (0x0000000Fu)
        #define GAIN_SETTING_6_RX_IF_GAIN_6_BIT              (0)
        #define GAIN_SETTING_6_RX_IF_GAIN_6_BITS             (4)

#define GAIN_SETTING_7                                       *((volatile int32u *)0x40001090u)
#define GAIN_SETTING_7_REG                                   *((volatile int32u *)0x40001090u)
#define GAIN_SETTING_7_ADDR                                  (0x40001090u)
#define GAIN_SETTING_7_RESET                                 (0x00000035u)
        /* RX_MIXER_GAIN_7 field */
        #define GAIN_SETTING_7_RX_MIXER_GAIN_7               (0x00000040u)
        #define GAIN_SETTING_7_RX_MIXER_GAIN_7_MASK          (0x00000040u)
        #define GAIN_SETTING_7_RX_MIXER_GAIN_7_BIT           (6)
        #define GAIN_SETTING_7_RX_MIXER_GAIN_7_BITS          (1)
        /* RX_FILTER_GAIN_7 field */
        #define GAIN_SETTING_7_RX_FILTER_GAIN_7              (0x00000030u)
        #define GAIN_SETTING_7_RX_FILTER_GAIN_7_MASK         (0x00000030u)
        #define GAIN_SETTING_7_RX_FILTER_GAIN_7_BIT          (4)
        #define GAIN_SETTING_7_RX_FILTER_GAIN_7_BITS         (2)
        /* RX_IF_GAIN_7 field */
        #define GAIN_SETTING_7_RX_IF_GAIN_7                  (0x0000000Fu)
        #define GAIN_SETTING_7_RX_IF_GAIN_7_MASK             (0x0000000Fu)
        #define GAIN_SETTING_7_RX_IF_GAIN_7_BIT              (0)
        #define GAIN_SETTING_7_RX_IF_GAIN_7_BITS             (4)

#define GAIN_SETTING_8                                       *((volatile int32u *)0x40001094u)
#define GAIN_SETTING_8_REG                                   *((volatile int32u *)0x40001094u)
#define GAIN_SETTING_8_ADDR                                  (0x40001094u)
#define GAIN_SETTING_8_RESET                                 (0x00000036u)
        /* RX_MIXER_GAIN_8 field */
        #define GAIN_SETTING_8_RX_MIXER_GAIN_8               (0x00000040u)
        #define GAIN_SETTING_8_RX_MIXER_GAIN_8_MASK          (0x00000040u)
        #define GAIN_SETTING_8_RX_MIXER_GAIN_8_BIT           (6)
        #define GAIN_SETTING_8_RX_MIXER_GAIN_8_BITS          (1)
        /* RX_FILTER_GAIN_8 field */
        #define GAIN_SETTING_8_RX_FILTER_GAIN_8              (0x00000030u)
        #define GAIN_SETTING_8_RX_FILTER_GAIN_8_MASK         (0x00000030u)
        #define GAIN_SETTING_8_RX_FILTER_GAIN_8_BIT          (4)
        #define GAIN_SETTING_8_RX_FILTER_GAIN_8_BITS         (2)
        /* RX_IF_GAIN_8 field */
        #define GAIN_SETTING_8_RX_IF_GAIN_8                  (0x0000000Fu)
        #define GAIN_SETTING_8_RX_IF_GAIN_8_MASK             (0x0000000Fu)
        #define GAIN_SETTING_8_RX_IF_GAIN_8_BIT              (0)
        #define GAIN_SETTING_8_RX_IF_GAIN_8_BITS             (4)

#define GAIN_SETTING_9                                       *((volatile int32u *)0x40001098u)
#define GAIN_SETTING_9_REG                                   *((volatile int32u *)0x40001098u)
#define GAIN_SETTING_9_ADDR                                  (0x40001098u)
#define GAIN_SETTING_9_RESET                                 (0x00000076u)
        /* RX_MIXER_GAIN_9 field */
        #define GAIN_SETTING_9_RX_MIXER_GAIN_9               (0x00000040u)
        #define GAIN_SETTING_9_RX_MIXER_GAIN_9_MASK          (0x00000040u)
        #define GAIN_SETTING_9_RX_MIXER_GAIN_9_BIT           (6)
        #define GAIN_SETTING_9_RX_MIXER_GAIN_9_BITS          (1)
        /* RX_FILTER_GAIN_9 field */
        #define GAIN_SETTING_9_RX_FILTER_GAIN_9              (0x00000030u)
        #define GAIN_SETTING_9_RX_FILTER_GAIN_9_MASK         (0x00000030u)
        #define GAIN_SETTING_9_RX_FILTER_GAIN_9_BIT          (4)
        #define GAIN_SETTING_9_RX_FILTER_GAIN_9_BITS         (2)
        /* RX_IF_GAIN_9 field */
        #define GAIN_SETTING_9_RX_IF_GAIN_9                  (0x0000000Fu)
        #define GAIN_SETTING_9_RX_IF_GAIN_9_MASK             (0x0000000Fu)
        #define GAIN_SETTING_9_RX_IF_GAIN_9_BIT              (0)
        #define GAIN_SETTING_9_RX_IF_GAIN_9_BITS             (4)

#define GAIN_SETTING_10                                      *((volatile int32u *)0x4000109Cu)
#define GAIN_SETTING_10_REG                                  *((volatile int32u *)0x4000109Cu)
#define GAIN_SETTING_10_ADDR                                 (0x4000109Cu)
#define GAIN_SETTING_10_RESET                                (0x00000077u)
        /* RX_MIXER_GAIN_10 field */
        #define GAIN_SETTING_10_RX_MIXER_GAIN_10             (0x00000040u)
        #define GAIN_SETTING_10_RX_MIXER_GAIN_10_MASK        (0x00000040u)
        #define GAIN_SETTING_10_RX_MIXER_GAIN_10_BIT         (6)
        #define GAIN_SETTING_10_RX_MIXER_GAIN_10_BITS        (1)
        /* RX_FILTER_GAIN_10 field */
        #define GAIN_SETTING_10_RX_FILTER_GAIN_10            (0x00000030u)
        #define GAIN_SETTING_10_RX_FILTER_GAIN_10_MASK       (0x00000030u)
        #define GAIN_SETTING_10_RX_FILTER_GAIN_10_BIT        (4)
        #define GAIN_SETTING_10_RX_FILTER_GAIN_10_BITS       (2)
        /* RX_IF_GAIN_10 field */
        #define GAIN_SETTING_10_RX_IF_GAIN_10                (0x0000000Fu)
        #define GAIN_SETTING_10_RX_IF_GAIN_10_MASK           (0x0000000Fu)
        #define GAIN_SETTING_10_RX_IF_GAIN_10_BIT            (0)
        #define GAIN_SETTING_10_RX_IF_GAIN_10_BITS           (4)

