contiki-os/contiki/cpu/stm32w108/hal/micro/cortexm3/stm32w108/regs.h
#define SCR_READ                                             *((volatile int32u *)0x400010F8u)
#define SCR_READ_REG                                         *((volatile int32u *)0x400010F8u)
#define SCR_READ_ADDR                                        (0x400010F8u)
#define SCR_READ_RESET                                       (0x00000000u)
        /* SCR_READ field */
        #define SCR_READ_SCR_READ                            (0x0000FFFFu)
        #define SCR_READ_SCR_READ_MASK                       (0x0000FFFFu)
        #define SCR_READ_SCR_READ_BIT                        (0)
        #define SCR_READ_SCR_READ_BITS                       (16)

#define SYNTH_LOCK                                           *((volatile int32u *)0x400010FCu)
#define SYNTH_LOCK_REG                                       *((volatile int32u *)0x400010FCu)
#define SYNTH_LOCK_ADDR                                      (0x400010FCu)
#define SYNTH_LOCK_RESET                                     (0x00000000u)
        /* IN_LOCK field */
        #define SYNTH_LOCK_IN_LOCK                           (0x00000001u)
        #define SYNTH_LOCK_IN_LOCK_MASK                      (0x00000001u)
        #define SYNTH_LOCK_IN_LOCK_BIT                       (0)
        #define SYNTH_LOCK_IN_LOCK_BITS                      (1)

#define AN_CAL_STATUS                                        *((volatile int32u *)0x40001100u)
#define AN_CAL_STATUS_REG                                    *((volatile int32u *)0x40001100u)
#define AN_CAL_STATUS_ADDR                                   (0x40001100u)
#define AN_CAL_STATUS_RESET                                  (0x00000000u)
        /* VCO_CTRL field */
        #define AN_CAL_STATUS_VCO_CTRL                       (0x0000000Cu)
        #define AN_CAL_STATUS_VCO_CTRL_MASK                  (0x0000000Cu)
        #define AN_CAL_STATUS_VCO_CTRL_BIT                   (2)
        #define AN_CAL_STATUS_VCO_CTRL_BITS                  (2)

#define BIAS_CAL_STATUS                                      *((volatile int32u *)0x40001104u)
#define BIAS_CAL_STATUS_REG                                  *((volatile int32u *)0x40001104u)
#define BIAS_CAL_STATUS_ADDR                                 (0x40001104u)
#define BIAS_CAL_STATUS_RESET                                (0x00000000u)
        /* VCOMP field */
        #define BIAS_CAL_STATUS_VCOMP                        (0x00000002u)
        #define BIAS_CAL_STATUS_VCOMP_MASK                   (0x00000002u)
        #define BIAS_CAL_STATUS_VCOMP_BIT                    (1)
        #define BIAS_CAL_STATUS_VCOMP_BITS                   (1)
        /* ICOMP field */
        #define BIAS_CAL_STATUS_ICOMP                        (0x00000001u)
        #define BIAS_CAL_STATUS_ICOMP_MASK                   (0x00000001u)
        #define BIAS_CAL_STATUS_ICOMP_BIT                    (0)
        #define BIAS_CAL_STATUS_ICOMP_BITS                   (1)

#define ATEST_SEL                                            *((volatile int32u *)0x40001108u)
#define ATEST_SEL_REG                                        *((volatile int32u *)0x40001108u)
#define ATEST_SEL_ADDR                                       (0x40001108u)
#define ATEST_SEL_RESET                                      (0x00000000u)
        /* ATEST_CTRL field */
        #define ATEST_SEL_ATEST_CTRL                         (0x0000FF00u)
        #define ATEST_SEL_ATEST_CTRL_MASK                    (0x0000FF00u)
        #define ATEST_SEL_ATEST_CTRL_BIT                     (8)
        #define ATEST_SEL_ATEST_CTRL_BITS                    (8)
        /* ATEST_SEL field */
        #define ATEST_SEL_ATEST_SEL                          (0x0000001Fu)
        #define ATEST_SEL_ATEST_SEL_MASK                     (0x0000001Fu)
        #define ATEST_SEL_ATEST_SEL_BIT                      (0)
        #define ATEST_SEL_ATEST_SEL_BITS                     (5)

#define AN_EN_TEST                                           *((volatile int32u *)0x4000110Cu)
#define AN_EN_TEST_REG                                       *((volatile int32u *)0x4000110Cu)
#define AN_EN_TEST_ADDR                                      (0x4000110Cu)
#define AN_EN_TEST_RESET                                     (0x00000000u)
        /* AN_TEST_MODE field */
        #define AN_EN_TEST_AN_TEST_MODE                      (0x00008000u)
        #define AN_EN_TEST_AN_TEST_MODE_MASK                 (0x00008000u)
        #define AN_EN_TEST_AN_TEST_MODE_BIT                  (15)
        #define AN_EN_TEST_AN_TEST_MODE_BITS                 (1)
        /* PFD_EN field */
        #define AN_EN_TEST_PFD_EN                            (0x00004000u)
        #define AN_EN_TEST_PFD_EN_MASK                       (0x00004000u)
        #define AN_EN_TEST_PFD_EN_BIT                        (14)
        #define AN_EN_TEST_PFD_EN_BITS                       (1)
        /* ADC_EN field */
        #define AN_EN_TEST_ADC_EN                            (0x00002000u)
        #define AN_EN_TEST_ADC_EN_MASK                       (0x00002000u)
        #define AN_EN_TEST_ADC_EN_BIT                        (13)
        #define AN_EN_TEST_ADC_EN_BITS                       (1)
        /* UNUSED field */
        #define AN_EN_TEST_UNUSED                            (0x00001000u)
        #define AN_EN_TEST_UNUSED_MASK                       (0x00001000u)
        #define AN_EN_TEST_UNUSED_BIT                        (12)
        #define AN_EN_TEST_UNUSED_BITS                       (1)
        /* PRE_FILT_EN field */
        #define AN_EN_TEST_PRE_FILT_EN                       (0x00000800u)
        #define AN_EN_TEST_PRE_FILT_EN_MASK                  (0x00000800u)
        #define AN_EN_TEST_PRE_FILT_EN_BIT                   (11)
        #define AN_EN_TEST_PRE_FILT_EN_BITS                  (1)
        /* IF_AMP_EN field */
        #define AN_EN_TEST_IF_AMP_EN                         (0x00000400u)
        #define AN_EN_TEST_IF_AMP_EN_MASK                    (0x00000400u)
        #define AN_EN_TEST_IF_AMP_EN_BIT                     (10)
        #define AN_EN_TEST_IF_AMP_EN_BITS                    (1)
        /* LNA_EN field */
        #define AN_EN_TEST_LNA_EN                            (0x00000200u)
        #define AN_EN_TEST_LNA_EN_MASK                       (0x00000200u)
        #define AN_EN_TEST_LNA_EN_BIT                        (9)
        #define AN_EN_TEST_LNA_EN_BITS                       (1)
        /* MIXER_EN field */
        #define AN_EN_TEST_MIXER_EN                          (0x00000100u)
        #define AN_EN_TEST_MIXER_EN_MASK                     (0x00000100u)
        #define AN_EN_TEST_MIXER_EN_BIT                      (8)
        #define AN_EN_TEST_MIXER_EN_BITS                     (1)
        /* CH_FILT_EN field */
        #define AN_EN_TEST_CH_FILT_EN                        (0x00000080u)
        #define AN_EN_TEST_CH_FILT_EN_MASK                   (0x00000080u)
        #define AN_EN_TEST_CH_FILT_EN_BIT                    (7)
        #define AN_EN_TEST_CH_FILT_EN_BITS                   (1)
        /* MOD_DAC_EN field */
        #define AN_EN_TEST_MOD_DAC_EN                        (0x00000040u)
        #define AN_EN_TEST_MOD_DAC_EN_MASK                   (0x00000040u)
        #define AN_EN_TEST_MOD_DAC_EN_BIT                    (6)
        #define AN_EN_TEST_MOD_DAC_EN_BITS                   (1)
        /* PA_EN field */
        #define AN_EN_TEST_PA_EN                             (0x00000010u)
        #define AN_EN_TEST_PA_EN_MASK                        (0x00000010u)
        #define AN_EN_TEST_PA_EN_BIT                         (4)
        #define AN_EN_TEST_PA_EN_BITS                        (1)
        /* PRESCALER_EN field */
        #define AN_EN_TEST_PRESCALER_EN                      (0x00000008u)
        #define AN_EN_TEST_PRESCALER_EN_MASK                 (0x00000008u)
        #define AN_EN_TEST_PRESCALER_EN_BIT                  (3)
        #define AN_EN_TEST_PRESCALER_EN_BITS                 (1)
        /* VCO_EN field */
        #define AN_EN_TEST_VCO_EN                            (0x00000004u)
        #define AN_EN_TEST_VCO_EN_MASK                       (0x00000004u)
        #define AN_EN_TEST_VCO_EN_BIT                        (2)
        #define AN_EN_TEST_VCO_EN_BITS                       (1)
        /* BIAS_EN field */
        #define AN_EN_TEST_BIAS_EN                           (0x00000001u)
        #define AN_EN_TEST_BIAS_EN_MASK                      (0x00000001u)
        #define AN_EN_TEST_BIAS_EN_BIT                       (0)
        #define AN_EN_TEST_BIAS_EN_BITS                      (1)

#define TUNE_FILTER_CTRL                                     *((volatile int32u *)0x40001110u)
#define TUNE_FILTER_CTRL_REG                                 *((volatile int32u *)0x40001110u)
#define TUNE_FILTER_CTRL_ADDR                                (0x40001110u)
#define TUNE_FILTER_CTRL_RESET                               (0x00000000u)
        /* TUNE_FILTER_EN field */
        #define TUNE_FILTER_CTRL_TUNE_FILTER_EN              (0x00000002u)
        #define TUNE_FILTER_CTRL_TUNE_FILTER_EN_MASK         (0x00000002u)
        #define TUNE_FILTER_CTRL_TUNE_FILTER_EN_BIT          (1)
        #define TUNE_FILTER_CTRL_TUNE_FILTER_EN_BITS         (1)
        /* TUNE_FILTER_RESET field */
        #define TUNE_FILTER_CTRL_TUNE_FILTER_RESET           (0x00000001u)
        #define TUNE_FILTER_CTRL_TUNE_FILTER_RESET_MASK      (0x00000001u)
        #define TUNE_FILTER_CTRL_TUNE_FILTER_RESET_BIT       (0)
        #define TUNE_FILTER_CTRL_TUNE_FILTER_RESET_BITS      (1)

