contiki-os/contiki/cpu/stm32w108/hal/micro/cortexm3/stm32w108/regs.h
#define NOISE_EN                                             *((volatile int32u *)0x40001114u)
#define NOISE_EN_REG                                         *((volatile int32u *)0x40001114u)
#define NOISE_EN_ADDR                                        (0x40001114u)
#define NOISE_EN_RESET                                       (0x00000000u)
        /* NOISE_EN field */
        #define NOISE_EN_NOISE_EN                            (0x00000001u)
        #define NOISE_EN_NOISE_EN_MASK                       (0x00000001u)
        #define NOISE_EN_NOISE_EN_BIT                        (0)
        #define NOISE_EN_NOISE_EN_BITS                       (1)

/* MAC block */
#define DATA_MAC_BASE                                        (0x40002000u)
#define DATA_MAC_END                                         (0x400020C8u)
#define DATA_MAC_SIZE                                        (DATA_MAC_END - DATA_MAC_BASE + 1)

#define MAC_RX_ST_ADDR_A                                     *((volatile int32u *)0x40002000u)
#define MAC_RX_ST_ADDR_A_REG                                 *((volatile int32u *)0x40002000u)
#define MAC_RX_ST_ADDR_A_ADDR                                (0x40002000u)
#define MAC_RX_ST_ADDR_A_RESET                               (0x20000000u)
        /* MAC_RAM_OFFS field */
        #define MAC_RX_ST_ADDR_A_MAC_RAM_OFFS                (0xFFFFE000u)
        #define MAC_RX_ST_ADDR_A_MAC_RAM_OFFS_MASK           (0xFFFFE000u)
        #define MAC_RX_ST_ADDR_A_MAC_RAM_OFFS_BIT            (13)
        #define MAC_RX_ST_ADDR_A_MAC_RAM_OFFS_BITS           (19)
        /* MAC_RX_ST_ADDR_A field */
        #define MAC_RX_ST_ADDR_A_MAC_RX_ST_ADDR_A            (0x00001FFEu)
        #define MAC_RX_ST_ADDR_A_MAC_RX_ST_ADDR_A_MASK       (0x00001FFEu)
        #define MAC_RX_ST_ADDR_A_MAC_RX_ST_ADDR_A_BIT        (1)
        #define MAC_RX_ST_ADDR_A_MAC_RX_ST_ADDR_A_BITS       (12)

#define MAC_RX_END_ADDR_A                                    *((volatile int32u *)0x40002004u)
#define MAC_RX_END_ADDR_A_REG                                *((volatile int32u *)0x40002004u)
#define MAC_RX_END_ADDR_A_ADDR                               (0x40002004u)
#define MAC_RX_END_ADDR_A_RESET                              (0x20000088u)
        /* MAC_RAM_OFFS field */
        #define MAC_RX_END_ADDR_A_MAC_RAM_OFFS               (0xFFFFE000u)
        #define MAC_RX_END_ADDR_A_MAC_RAM_OFFS_MASK          (0xFFFFE000u)
        #define MAC_RX_END_ADDR_A_MAC_RAM_OFFS_BIT           (13)
        #define MAC_RX_END_ADDR_A_MAC_RAM_OFFS_BITS          (19)
        /* MAC_RX_END_ADDR_A field */
        #define MAC_RX_END_ADDR_A_MAC_RX_END_ADDR_A          (0x00001FFEu)
        #define MAC_RX_END_ADDR_A_MAC_RX_END_ADDR_A_MASK     (0x00001FFEu)
        #define MAC_RX_END_ADDR_A_MAC_RX_END_ADDR_A_BIT      (1)
        #define MAC_RX_END_ADDR_A_MAC_RX_END_ADDR_A_BITS     (12)

#define MAC_RX_ST_ADDR_B                                     *((volatile int32u *)0x40002008u)
#define MAC_RX_ST_ADDR_B_REG                                 *((volatile int32u *)0x40002008u)
#define MAC_RX_ST_ADDR_B_ADDR                                (0x40002008u)
#define MAC_RX_ST_ADDR_B_RESET                               (0x20000000u)
        /* MAC_RAM_OFFS field */
        #define MAC_RX_ST_ADDR_B_MAC_RAM_OFFS                (0xFFFFE000u)
        #define MAC_RX_ST_ADDR_B_MAC_RAM_OFFS_MASK           (0xFFFFE000u)
        #define MAC_RX_ST_ADDR_B_MAC_RAM_OFFS_BIT            (13)
        #define MAC_RX_ST_ADDR_B_MAC_RAM_OFFS_BITS           (19)
        /* MAC_RX_ST_ADDR_B field */
        #define MAC_RX_ST_ADDR_B_MAC_RX_ST_ADDR_B            (0x00001FFEu)
        #define MAC_RX_ST_ADDR_B_MAC_RX_ST_ADDR_B_MASK       (0x00001FFEu)
        #define MAC_RX_ST_ADDR_B_MAC_RX_ST_ADDR_B_BIT        (1)
        #define MAC_RX_ST_ADDR_B_MAC_RX_ST_ADDR_B_BITS       (12)

#define MAC_RX_END_ADDR_B                                    *((volatile int32u *)0x4000200Cu)
#define MAC_RX_END_ADDR_B_REG                                *((volatile int32u *)0x4000200Cu)
#define MAC_RX_END_ADDR_B_ADDR                               (0x4000200Cu)
#define MAC_RX_END_ADDR_B_RESET                              (0x20000088u)
        /* MAC_RAM_OFFS field */
        #define MAC_RX_END_ADDR_B_MAC_RAM_OFFS               (0xFFFFE000u)
        #define MAC_RX_END_ADDR_B_MAC_RAM_OFFS_MASK          (0xFFFFE000u)
        #define MAC_RX_END_ADDR_B_MAC_RAM_OFFS_BIT           (13)
        #define MAC_RX_END_ADDR_B_MAC_RAM_OFFS_BITS          (19)
        /* MAC_RX_END_ADDR_B field */
        #define MAC_RX_END_ADDR_B_MAC_RX_END_ADDR_B          (0x00001FFEu)
        #define MAC_RX_END_ADDR_B_MAC_RX_END_ADDR_B_MASK     (0x00001FFEu)
        #define MAC_RX_END_ADDR_B_MAC_RX_END_ADDR_B_BIT      (1)
        #define MAC_RX_END_ADDR_B_MAC_RX_END_ADDR_B_BITS     (12)

#define MAC_TX_ST_ADDR_A                                     *((volatile int32u *)0x40002010u)
#define MAC_TX_ST_ADDR_A_REG                                 *((volatile int32u *)0x40002010u)
#define MAC_TX_ST_ADDR_A_ADDR                                (0x40002010u)
#define MAC_TX_ST_ADDR_A_RESET                               (0x20000000u)
        /* MAC_RAM_OFFS field */
        #define MAC_TX_ST_ADDR_A_MAC_RAM_OFFS                (0xFFFFE000u)
        #define MAC_TX_ST_ADDR_A_MAC_RAM_OFFS_MASK           (0xFFFFE000u)
        #define MAC_TX_ST_ADDR_A_MAC_RAM_OFFS_BIT            (13)
        #define MAC_TX_ST_ADDR_A_MAC_RAM_OFFS_BITS           (19)
        /* MAC_TX_ST_ADDR_A field */
        #define MAC_TX_ST_ADDR_A_MAC_TX_ST_ADDR_A            (0x00001FFEu)
        #define MAC_TX_ST_ADDR_A_MAC_TX_ST_ADDR_A_MASK       (0x00001FFEu)
        #define MAC_TX_ST_ADDR_A_MAC_TX_ST_ADDR_A_BIT        (1)
        #define MAC_TX_ST_ADDR_A_MAC_TX_ST_ADDR_A_BITS       (12)

#define MAC_TX_END_ADDR_A                                    *((volatile int32u *)0x40002014u)
#define MAC_TX_END_ADDR_A_REG                                *((volatile int32u *)0x40002014u)
#define MAC_TX_END_ADDR_A_ADDR                               (0x40002014u)
#define MAC_TX_END_ADDR_A_RESET                              (0x20000000u)
        /* MAC_RAM_OFFS field */
        #define MAC_TX_END_ADDR_A_MAC_RAM_OFFS               (0xFFFFE000u)
        #define MAC_TX_END_ADDR_A_MAC_RAM_OFFS_MASK          (0xFFFFE000u)
        #define MAC_TX_END_ADDR_A_MAC_RAM_OFFS_BIT           (13)
        #define MAC_TX_END_ADDR_A_MAC_RAM_OFFS_BITS          (19)
        /* MAC_TX_END_ADDR_A field */
        #define MAC_TX_END_ADDR_A_MAC_TX_END_ADDR_A          (0x00001FFEu)
        #define MAC_TX_END_ADDR_A_MAC_TX_END_ADDR_A_MASK     (0x00001FFEu)
        #define MAC_TX_END_ADDR_A_MAC_TX_END_ADDR_A_BIT      (1)
        #define MAC_TX_END_ADDR_A_MAC_TX_END_ADDR_A_BITS     (12)

#define MAC_TX_ST_ADDR_B                                     *((volatile int32u *)0x40002018u)
#define MAC_TX_ST_ADDR_B_REG                                 *((volatile int32u *)0x40002018u)
#define MAC_TX_ST_ADDR_B_ADDR                                (0x40002018u)
#define MAC_TX_ST_ADDR_B_RESET                               (0x20000000u)
        /* MAC_RAM_OFFS field */
        #define MAC_TX_ST_ADDR_B_MAC_RAM_OFFS                (0xFFFFE000u)
        #define MAC_TX_ST_ADDR_B_MAC_RAM_OFFS_MASK           (0xFFFFE000u)
        #define MAC_TX_ST_ADDR_B_MAC_RAM_OFFS_BIT            (13)
        #define MAC_TX_ST_ADDR_B_MAC_RAM_OFFS_BITS           (19)
        /* MAC_TX_ST_ADDR_B field */
        #define MAC_TX_ST_ADDR_B_MAC_TX_ST_ADDR_B            (0x00001FFEu)
        #define MAC_TX_ST_ADDR_B_MAC_TX_ST_ADDR_B_MASK       (0x00001FFEu)
        #define MAC_TX_ST_ADDR_B_MAC_TX_ST_ADDR_B_BIT        (1)
        #define MAC_TX_ST_ADDR_B_MAC_TX_ST_ADDR_B_BITS       (12)

#define MAC_TX_END_ADDR_B                                    *((volatile int32u *)0x4000201Cu)
#define MAC_TX_END_ADDR_B_REG                                *((volatile int32u *)0x4000201Cu)
#define MAC_TX_END_ADDR_B_ADDR                               (0x4000201Cu)
#define MAC_TX_END_ADDR_B_RESET                              (0x20000000u)
        /* MAC_RAM_OFFS field */
        #define MAC_TX_END_ADDR_B_MAC_RAM_OFFS               (0xFFFFE000u)
        #define MAC_TX_END_ADDR_B_MAC_RAM_OFFS_MASK          (0xFFFFE000u)
        #define MAC_TX_END_ADDR_B_MAC_RAM_OFFS_BIT           (13)
        #define MAC_TX_END_ADDR_B_MAC_RAM_OFFS_BITS          (19)
        /* MAC_TX_END_ADDR_B field */
        #define MAC_TX_END_ADDR_B_MAC_TX_END_ADDR_B          (0x00001FFEu)
        #define MAC_TX_END_ADDR_B_MAC_TX_END_ADDR_B_MASK     (0x00001FFEu)
        #define MAC_TX_END_ADDR_B_MAC_TX_END_ADDR_B_BIT      (1)
        #define MAC_TX_END_ADDR_B_MAC_TX_END_ADDR_B_BITS     (12)

