contiki-os/contiki/cpu/stm32w108/hal/micro/cortexm3/stm32w108/regs.h
#define MAC_TIMER_CTRL                                       *((volatile int32u *)0x4000208Cu)
#define MAC_TIMER_CTRL_REG                                   *((volatile int32u *)0x4000208Cu)
#define MAC_TIMER_CTRL_ADDR                                  (0x4000208Cu)
#define MAC_TIMER_CTRL_RESET                                 (0x00000000u)
        /* COMP_A_SYNC field */
        #define MAC_TIMER_CTRL_COMP_A_SYNC                   (0x00000040u)
        #define MAC_TIMER_CTRL_COMP_A_SYNC_MASK              (0x00000040u)
        #define MAC_TIMER_CTRL_COMP_A_SYNC_BIT               (6)
        #define MAC_TIMER_CTRL_COMP_A_SYNC_BITS              (1)
        /* BOP_TIMER_RST field */
        #define MAC_TIMER_CTRL_BOP_TIMER_RST                 (0x00000020u)
        #define MAC_TIMER_CTRL_BOP_TIMER_RST_MASK            (0x00000020u)
        #define MAC_TIMER_CTRL_BOP_TIMER_RST_BIT             (5)
        #define MAC_TIMER_CTRL_BOP_TIMER_RST_BITS            (1)
        /* BOP_TIMER_EN field */
        #define MAC_TIMER_CTRL_BOP_TIMER_EN                  (0x00000010u)
        #define MAC_TIMER_CTRL_BOP_TIMER_EN_MASK             (0x00000010u)
        #define MAC_TIMER_CTRL_BOP_TIMER_EN_BIT              (4)
        #define MAC_TIMER_CTRL_BOP_TIMER_EN_BITS             (1)
        /* BO_TIMER_RST field */
        #define MAC_TIMER_CTRL_BO_TIMER_RST                  (0x00000008u)
        #define MAC_TIMER_CTRL_BO_TIMER_RST_MASK             (0x00000008u)
        #define MAC_TIMER_CTRL_BO_TIMER_RST_BIT              (3)
        #define MAC_TIMER_CTRL_BO_TIMER_RST_BITS             (1)
        /* BO_TIMER_EN field */
        #define MAC_TIMER_CTRL_BO_TIMER_EN                   (0x00000004u)
        #define MAC_TIMER_CTRL_BO_TIMER_EN_MASK              (0x00000004u)
        #define MAC_TIMER_CTRL_BO_TIMER_EN_BIT               (2)
        #define MAC_TIMER_CTRL_BO_TIMER_EN_BITS              (1)
        /* MAC_TIMER_RST field */
        #define MAC_TIMER_CTRL_MAC_TIMER_RST                 (0x00000002u)
        #define MAC_TIMER_CTRL_MAC_TIMER_RST_MASK            (0x00000002u)
        #define MAC_TIMER_CTRL_MAC_TIMER_RST_BIT             (1)
        #define MAC_TIMER_CTRL_MAC_TIMER_RST_BITS            (1)
        /* MAC_TIMER_EN field */
        #define MAC_TIMER_CTRL_MAC_TIMER_EN                  (0x00000001u)
        #define MAC_TIMER_CTRL_MAC_TIMER_EN_MASK             (0x00000001u)
        #define MAC_TIMER_CTRL_MAC_TIMER_EN_BIT              (0)
        #define MAC_TIMER_CTRL_MAC_TIMER_EN_BITS             (1)

#define PAN_ID                                               *((volatile int32u *)0x40002090u)
#define PAN_ID_REG                                           *((volatile int32u *)0x40002090u)
#define PAN_ID_ADDR                                          (0x40002090u)
#define PAN_ID_RESET                                         (0x00000000u)
        /* PAN_ID field */
        #define PAN_ID_PAN_ID                                (0x0000FFFFu)
        #define PAN_ID_PAN_ID_MASK                           (0x0000FFFFu)
        #define PAN_ID_PAN_ID_BIT                            (0)
        #define PAN_ID_PAN_ID_BITS                           (16)

#define SHORT_ADDR                                           *((volatile int32u *)0x40002094u)
#define SHORT_ADDR_REG                                       *((volatile int32u *)0x40002094u)
#define SHORT_ADDR_ADDR                                      (0x40002094u)
#define SHORT_ADDR_RESET                                     (0x00000000u)
        /* SHORT_ADDR field */
        #define SHORT_ADDR_SHORT_ADDR                        (0x0000FFFFu)
        #define SHORT_ADDR_SHORT_ADDR_MASK                   (0x0000FFFFu)
        #define SHORT_ADDR_SHORT_ADDR_BIT                    (0)
        #define SHORT_ADDR_SHORT_ADDR_BITS                   (16)

#define EXT_ADDR_0                                           *((volatile int32u *)0x40002098u)
#define EXT_ADDR_0_REG                                       *((volatile int32u *)0x40002098u)
#define EXT_ADDR_0_ADDR                                      (0x40002098u)
#define EXT_ADDR_0_RESET                                     (0x00000000u)
        /* EXT_ADDR_0 field */
        #define EXT_ADDR_0_EXT_ADDR_0                        (0x0000FFFFu)
        #define EXT_ADDR_0_EXT_ADDR_0_MASK                   (0x0000FFFFu)
        #define EXT_ADDR_0_EXT_ADDR_0_BIT                    (0)
        #define EXT_ADDR_0_EXT_ADDR_0_BITS                   (16)

#define EXT_ADDR_1                                           *((volatile int32u *)0x4000209Cu)
#define EXT_ADDR_1_REG                                       *((volatile int32u *)0x4000209Cu)
#define EXT_ADDR_1_ADDR                                      (0x4000209Cu)
#define EXT_ADDR_1_RESET                                     (0x00000000u)
        /* EXT_ADDR_1 field */
        #define EXT_ADDR_1_EXT_ADDR_1                        (0x0000FFFFu)
        #define EXT_ADDR_1_EXT_ADDR_1_MASK                   (0x0000FFFFu)
        #define EXT_ADDR_1_EXT_ADDR_1_BIT                    (0)
        #define EXT_ADDR_1_EXT_ADDR_1_BITS                   (16)

#define EXT_ADDR_2                                           *((volatile int32u *)0x400020A0u)
#define EXT_ADDR_2_REG                                       *((volatile int32u *)0x400020A0u)
#define EXT_ADDR_2_ADDR                                      (0x400020A0u)
#define EXT_ADDR_2_RESET                                     (0x00000000u)
        /* EXT_ADDR_2 field */
        #define EXT_ADDR_2_EXT_ADDR_2                        (0x0000FFFFu)
        #define EXT_ADDR_2_EXT_ADDR_2_MASK                   (0x0000FFFFu)
        #define EXT_ADDR_2_EXT_ADDR_2_BIT                    (0)
        #define EXT_ADDR_2_EXT_ADDR_2_BITS                   (16)

#define EXT_ADDR_3                                           *((volatile int32u *)0x400020A4u)
#define EXT_ADDR_3_REG                                       *((volatile int32u *)0x400020A4u)
#define EXT_ADDR_3_ADDR                                      (0x400020A4u)
#define EXT_ADDR_3_RESET                                     (0x00000000u)
        /* EXT_ADDR_3 field */
        #define EXT_ADDR_3_EXT_ADDR_3                        (0x0000FFFFu)
        #define EXT_ADDR_3_EXT_ADDR_3_MASK                   (0x0000FFFFu)
        #define EXT_ADDR_3_EXT_ADDR_3_BIT                    (0)
        #define EXT_ADDR_3_EXT_ADDR_3_BITS                   (16)

#define MAC_STATE                                            *((volatile int32u *)0x400020A8u)
#define MAC_STATE_REG                                        *((volatile int32u *)0x400020A8u)
#define MAC_STATE_ADDR                                       (0x400020A8u)
#define MAC_STATE_RESET                                      (0x00000000u)
        /* SPY_STATE field */
        #define MAC_STATE_SPY_STATE                          (0x00000700u)
        #define MAC_STATE_SPY_STATE_MASK                     (0x00000700u)
        #define MAC_STATE_SPY_STATE_BIT                      (8)
        #define MAC_STATE_SPY_STATE_BITS                     (3)
        /* ACK_STATE field */
        #define MAC_STATE_ACK_STATE                          (0x000000C0u)
        #define MAC_STATE_ACK_STATE_MASK                     (0x000000C0u)
        #define MAC_STATE_ACK_STATE_BIT                      (6)
        #define MAC_STATE_ACK_STATE_BITS                     (2)
        /* BO_STATE field */
        #define MAC_STATE_BO_STATE                           (0x0000003Cu)
        #define MAC_STATE_BO_STATE_MASK                      (0x0000003Cu)
        #define MAC_STATE_BO_STATE_BIT                       (2)
        #define MAC_STATE_BO_STATE_BITS                      (4)
        /* TOP_STATE field */
        #define MAC_STATE_TOP_STATE                          (0x00000003u)
        #define MAC_STATE_TOP_STATE_MASK                     (0x00000003u)
        #define MAC_STATE_TOP_STATE_BIT                      (0)
        #define MAC_STATE_TOP_STATE_BITS                     (2)

#define RX_STATE                                             *((volatile int32u *)0x400020ACu)
#define RX_STATE_REG                                         *((volatile int32u *)0x400020ACu)
#define RX_STATE_ADDR                                        (0x400020ACu)
#define RX_STATE_RESET                                       (0x00000000u)
        /* RX_BUFFER_STATE field */
        #define RX_STATE_RX_BUFFER_STATE                     (0x000001E0u)
        #define RX_STATE_RX_BUFFER_STATE_MASK                (0x000001E0u)
        #define RX_STATE_RX_BUFFER_STATE_BIT                 (5)
        #define RX_STATE_RX_BUFFER_STATE_BITS                (4)
        /* RX_TOP_STATE field */
        #define RX_STATE_RX_TOP_STATE                        (0x0000001Fu)
        #define RX_STATE_RX_TOP_STATE_MASK                   (0x0000001Fu)
        #define RX_STATE_RX_TOP_STATE_BIT                    (0)
        #define RX_STATE_RX_TOP_STATE_BITS                   (5)

#define TX_STATE                                             *((volatile int32u *)0x400020B0u)
#define TX_STATE_REG                                         *((volatile int32u *)0x400020B0u)
#define TX_STATE_ADDR                                        (0x400020B0u)
#define TX_STATE_RESET                                       (0x00000000u)
        /* TX_BUFFER_STATE field */
        #define TX_STATE_TX_BUFFER_STATE                     (0x000000F0u)
        #define TX_STATE_TX_BUFFER_STATE_MASK                (0x000000F0u)
        #define TX_STATE_TX_BUFFER_STATE_BIT                 (4)
        #define TX_STATE_TX_BUFFER_STATE_BITS                (4)
        /* TX_TOP_STATE field */
        #define TX_STATE_TX_TOP_STATE                        (0x0000000Fu)
        #define TX_STATE_TX_TOP_STATE_MASK                   (0x0000000Fu)
        #define TX_STATE_TX_TOP_STATE_BIT                    (0)
        #define TX_STATE_TX_TOP_STATE_BITS                   (4)

#define DMA_STATE                                            *((volatile int32u *)0x400020B4u)
#define DMA_STATE_REG                                        *((volatile int32u *)0x400020B4u)
#define DMA_STATE_ADDR                                       (0x400020B4u)
#define DMA_STATE_RESET                                      (0x00000000u)
        /* DMA_RX_STATE field */
        #define DMA_STATE_DMA_RX_STATE                       (0x00000038u)
        #define DMA_STATE_DMA_RX_STATE_MASK                  (0x00000038u)
        #define DMA_STATE_DMA_RX_STATE_BIT                   (3)
        #define DMA_STATE_DMA_RX_STATE_BITS                  (3)
        /* DMA_TX_STATE field */
        #define DMA_STATE_DMA_TX_STATE                       (0x00000007u)
        #define DMA_STATE_DMA_TX_STATE_MASK                  (0x00000007u)
        #define DMA_STATE_DMA_TX_STATE_BIT                   (0)
        #define DMA_STATE_DMA_TX_STATE_BITS                  (3)

