contiki-os/contiki/cpu/stm32w108/hal/micro/cortexm3/stm32w108/regs.h
#define MAC_DEBUG                                            *((volatile int32u *)0x400020B8u)
#define MAC_DEBUG_REG                                        *((volatile int32u *)0x400020B8u)
#define MAC_DEBUG_ADDR                                       (0x400020B8u)
#define MAC_DEBUG_RESET                                      (0x00000000u)
        /* SW_DEBUG_OUT field */
        #define MAC_DEBUG_SW_DEBUG_OUT                       (0x00000060u)
        #define MAC_DEBUG_SW_DEBUG_OUT_MASK                  (0x00000060u)
        #define MAC_DEBUG_SW_DEBUG_OUT_BIT                   (5)
        #define MAC_DEBUG_SW_DEBUG_OUT_BITS                  (2)
        /* MAC_DEBUG_MUX field */
        #define MAC_DEBUG_MAC_DEBUG_MUX                      (0x0000001Fu)
        #define MAC_DEBUG_MAC_DEBUG_MUX_MASK                 (0x0000001Fu)
        #define MAC_DEBUG_MAC_DEBUG_MUX_BIT                  (0)
        #define MAC_DEBUG_MAC_DEBUG_MUX_BITS                 (5)

#define MAC_DEBUG_VIEW                                       *((volatile int32u *)0x400020BCu)
#define MAC_DEBUG_VIEW_REG                                   *((volatile int32u *)0x400020BCu)
#define MAC_DEBUG_VIEW_ADDR                                  (0x400020BCu)
#define MAC_DEBUG_VIEW_RESET                                 (0x00000010u)
        /* MAC_DEBUG_VIEW field */
        #define MAC_DEBUG_VIEW_MAC_DEBUG_VIEW                (0x0000FFFFu)
        #define MAC_DEBUG_VIEW_MAC_DEBUG_VIEW_MASK           (0x0000FFFFu)
        #define MAC_DEBUG_VIEW_MAC_DEBUG_VIEW_BIT            (0)
        #define MAC_DEBUG_VIEW_MAC_DEBUG_VIEW_BITS           (16)

#define MAC_RSSI_DELAY                                       *((volatile int32u *)0x400020C0u)
#define MAC_RSSI_DELAY_REG                                   *((volatile int32u *)0x400020C0u)
#define MAC_RSSI_DELAY_ADDR                                  (0x400020C0u)
#define MAC_RSSI_DELAY_RESET                                 (0x00000000u)
        /* RSSI_INST_DELAY_OK field */
        #define MAC_RSSI_DELAY_RSSI_INST_DELAY_OK            (0x00000FC0u)
        #define MAC_RSSI_DELAY_RSSI_INST_DELAY_OK_MASK       (0x00000FC0u)
        #define MAC_RSSI_DELAY_RSSI_INST_DELAY_OK_BIT        (6)
        #define MAC_RSSI_DELAY_RSSI_INST_DELAY_OK_BITS       (6)
        /* RSSI_INST_DELAY field */
        #define MAC_RSSI_DELAY_RSSI_INST_DELAY               (0x0000003Fu)
        #define MAC_RSSI_DELAY_RSSI_INST_DELAY_MASK          (0x0000003Fu)
        #define MAC_RSSI_DELAY_RSSI_INST_DELAY_BIT           (0)
        #define MAC_RSSI_DELAY_RSSI_INST_DELAY_BITS          (6)

#define PANID_COUNT                                          *((volatile int32u *)0x400020C4u)
#define PANID_COUNT_REG                                      *((volatile int32u *)0x400020C4u)
#define PANID_COUNT_ADDR                                     (0x400020C4u)
#define PANID_COUNT_RESET                                    (0x00000000u)
        /* PANID_COUNT field */
        #define PANID_COUNT_PANID_COUNT                      (0x0000FFFFu)
        #define PANID_COUNT_PANID_COUNT_MASK                 (0x0000FFFFu)
        #define PANID_COUNT_PANID_COUNT_BIT                  (0)
        #define PANID_COUNT_PANID_COUNT_BITS                 (16)

#define NONPAN_COUNT                                         *((volatile int32u *)0x400020C8u)
#define NONPAN_COUNT_REG                                     *((volatile int32u *)0x400020C8u)
#define NONPAN_COUNT_ADDR                                    (0x400020C8u)
#define NONPAN_COUNT_RESET                                   (0x00000000u)
        /* NONPAN_COUNT field */
        #define NONPAN_COUNT_NONPAN_COUNT                    (0x0000FFFFu)
        #define NONPAN_COUNT_NONPAN_COUNT_MASK               (0x0000FFFFu)
        #define NONPAN_COUNT_NONPAN_COUNT_BIT                (0)
        #define NONPAN_COUNT_NONPAN_COUNT_BITS               (16)

/* SECURITY block */
#define DATA_SECURITY_BASE                                   (0x40003000u)
#define DATA_SECURITY_END                                    (0x40003044u)
#define DATA_SECURITY_SIZE                                   (DATA_SECURITY_END - DATA_SECURITY_BASE + 1)

#define SECURITY_CONFIG                                      *((volatile int32u *)0x40003000u)
#define SECURITY_CONFIG_REG                                  *((volatile int32u *)0x40003000u)
#define SECURITY_CONFIG_ADDR                                 (0x40003000u)
#define SECURITY_CONFIG_RESET                                (0x00000000u)
        /* SEC_RST field */
        #define SECURITY_CONFIG_SEC_RST                      (0x00000080u)
        #define SECURITY_CONFIG_SEC_RST_MASK                 (0x00000080u)
        #define SECURITY_CONFIG_SEC_RST_BIT                  (7)
        #define SECURITY_CONFIG_SEC_RST_BITS                 (1)
        /* CTR_IN field */
        #define SECURITY_CONFIG_CTR_IN                       (0x00000040u)
        #define SECURITY_CONFIG_CTR_IN_MASK                  (0x00000040u)
        #define SECURITY_CONFIG_CTR_IN_BIT                   (6)
        #define SECURITY_CONFIG_CTR_IN_BITS                  (1)
        /* MIC_XOR_CT field */
        #define SECURITY_CONFIG_MIC_XOR_CT                   (0x00000020u)
        #define SECURITY_CONFIG_MIC_XOR_CT_MASK              (0x00000020u)
        #define SECURITY_CONFIG_MIC_XOR_CT_BIT               (5)
        #define SECURITY_CONFIG_MIC_XOR_CT_BITS              (1)
        /* CBC_XOR_PT field */
        #define SECURITY_CONFIG_CBC_XOR_PT                   (0x00000010u)
        #define SECURITY_CONFIG_CBC_XOR_PT_MASK              (0x00000010u)
        #define SECURITY_CONFIG_CBC_XOR_PT_BIT               (4)
        #define SECURITY_CONFIG_CBC_XOR_PT_BITS              (1)
        /* CT_TO_CBC_ST field */
        #define SECURITY_CONFIG_CT_TO_CBC_ST                 (0x00000008u)
        #define SECURITY_CONFIG_CT_TO_CBC_ST_MASK            (0x00000008u)
        #define SECURITY_CONFIG_CT_TO_CBC_ST_BIT             (3)
        #define SECURITY_CONFIG_CT_TO_CBC_ST_BITS            (1)
        /* WAIT_CT_READ field */
        #define SECURITY_CONFIG_WAIT_CT_READ                 (0x00000004u)
        #define SECURITY_CONFIG_WAIT_CT_READ_MASK            (0x00000004u)
        #define SECURITY_CONFIG_WAIT_CT_READ_BIT             (2)
        #define SECURITY_CONFIG_WAIT_CT_READ_BITS            (1)
        /* WAIT_PT_WRITE field */
        #define SECURITY_CONFIG_WAIT_PT_WRITE                (0x00000002u)
        #define SECURITY_CONFIG_WAIT_PT_WRITE_MASK           (0x00000002u)
        #define SECURITY_CONFIG_WAIT_PT_WRITE_BIT            (1)
        #define SECURITY_CONFIG_WAIT_PT_WRITE_BITS           (1)
        /* START_AES field */
        #define SECURITY_CONFIG_START_AES                    (0x00000001u)
        #define SECURITY_CONFIG_START_AES_MASK               (0x00000001u)
        #define SECURITY_CONFIG_START_AES_BIT                (0)
        #define SECURITY_CONFIG_START_AES_BITS               (1)

#define SECURITY_STATUS                                      *((volatile int32u *)0x40003004u)
#define SECURITY_STATUS_REG                                  *((volatile int32u *)0x40003004u)
#define SECURITY_STATUS_ADDR                                 (0x40003004u)
#define SECURITY_STATUS_RESET                                (0x00000000u)
        /* SEC_BUSY field */
        #define SECURITY_STATUS_SEC_BUSY                     (0x00000001u)
        #define SECURITY_STATUS_SEC_BUSY_MASK                (0x00000001u)
        #define SECURITY_STATUS_SEC_BUSY_BIT                 (0)
        #define SECURITY_STATUS_SEC_BUSY_BITS                (1)

#define CBC_STATE_0                                          *((volatile int32u *)0x40003008u)
#define CBC_STATE_0_REG                                      *((volatile int32u *)0x40003008u)
#define CBC_STATE_0_ADDR                                     (0x40003008u)
#define CBC_STATE_0_RESET                                    (0x00000000u)
        /* CBC_STATE field */
        #define CBC_STATE_0_CBC_STATE                        (0xFFFFFFFFu)
        #define CBC_STATE_0_CBC_STATE_MASK                   (0xFFFFFFFFu)
        #define CBC_STATE_0_CBC_STATE_BIT                    (0)
        #define CBC_STATE_0_CBC_STATE_BITS                   (32)

