contiki-os/contiki/cpu/stm32w108/hal/micro/cortexm3/stm32w108/regs.h
#define DITHER_DIS                                           *((volatile int32u *)0x40004018u)
#define DITHER_DIS_REG                                       *((volatile int32u *)0x40004018u)
#define DITHER_DIS_ADDR                                      (0x40004018u)
#define DITHER_DIS_RESET                                     (0x00000000u)
        /* DITHER_DIS field */
        #define DITHER_DIS_DITHER_DIS                        (0x00000001u)
        #define DITHER_DIS_DITHER_DIS_MASK                   (0x00000001u)
        #define DITHER_DIS_DITHER_DIS_BIT                    (0)
        #define DITHER_DIS_DITHER_DIS_BITS                   (1)

#define OSC24M_CTRL                                          *((volatile int32u *)0x4000401Cu)
#define OSC24M_CTRL_REG                                      *((volatile int32u *)0x4000401Cu)
#define OSC24M_CTRL_ADDR                                     (0x4000401Cu)
#define OSC24M_CTRL_RESET                                    (0x00000000u)
        /* OSC24M_EN field */
        #define OSC24M_CTRL_OSC24M_EN                        (0x00000002u)
        #define OSC24M_CTRL_OSC24M_EN_MASK                   (0x00000002u)
        #define OSC24M_CTRL_OSC24M_EN_BIT                    (1)
        #define OSC24M_CTRL_OSC24M_EN_BITS                   (1)
        /* OSC24M_SEL field */
        #define OSC24M_CTRL_OSC24M_SEL                       (0x00000001u)
        #define OSC24M_CTRL_OSC24M_SEL_MASK                  (0x00000001u)
        #define OSC24M_CTRL_OSC24M_SEL_BIT                   (0)
        #define OSC24M_CTRL_OSC24M_SEL_BITS                  (1)

#define CPU_CLKSEL                                           *((volatile int32u *)0x40004020u)
#define CPU_CLKSEL_REG                                       *((volatile int32u *)0x40004020u)
#define CPU_CLKSEL_ADDR                                      (0x40004020u)
#define CPU_CLKSEL_RESET                                     (0x00000000u)
        /* CPU_CLKSEL_FIELD field */
        #define CPU_CLKSEL_FIELD                             (0x00000001u)
        #define CPU_CLKSEL_FIELD_MASK                        (0x00000001u)
        #define CPU_CLKSEL_FIELD_BIT                         (0)
        #define CPU_CLKSEL_FIELD_BITS                        (1)

#define BUS_FAULT                                            *((volatile int32u *)0x40004024u)
#define BUS_FAULT_REG                                        *((volatile int32u *)0x40004024u)
#define BUS_FAULT_ADDR                                       (0x40004024u)
#define BUS_FAULT_RESET                                      (0x00000000u)
        /* WRONGSIZE field */
        #define BUS_FAULT_WRONGSIZE                          (0x00000008u)
        #define BUS_FAULT_WRONGSIZE_MASK                     (0x00000008u)
        #define BUS_FAULT_WRONGSIZE_BIT                      (3)
        #define BUS_FAULT_WRONGSIZE_BITS                     (1)
        /* PROTECTED field */
        #define BUS_FAULT_PROTECTED                          (0x00000004u)
        #define BUS_FAULT_PROTECTED_MASK                     (0x00000004u)
        #define BUS_FAULT_PROTECTED_BIT                      (2)
        #define BUS_FAULT_PROTECTED_BITS                     (1)
        /* RESERVED field */
        #define BUS_FAULT_RESERVED                           (0x00000002u)
        #define BUS_FAULT_RESERVED_MASK                      (0x00000002u)
        #define BUS_FAULT_RESERVED_BIT                       (1)
        #define BUS_FAULT_RESERVED_BITS                      (1)
        /* MISSED field */
        #define BUS_FAULT_MISSED                             (0x00000001u)
        #define BUS_FAULT_MISSED_MASK                        (0x00000001u)
        #define BUS_FAULT_MISSED_BIT                         (0)
        #define BUS_FAULT_MISSED_BITS                        (1)

#define PCTRACE_SEL                                          *((volatile int32u *)0x40004028u)
#define PCTRACE_SEL_REG                                      *((volatile int32u *)0x40004028u)
#define PCTRACE_SEL_ADDR                                     (0x40004028u)
#define PCTRACE_SEL_RESET                                    (0x00000000u)
        /* PCTRACE_SEL_FIELD field */
        #define PCTRACE_SEL_FIELD                            (0x00000001u)
        #define PCTRACE_SEL_FIELD_MASK                       (0x00000001u)
        #define PCTRACE_SEL_FIELD_BIT                        (0)
        #define PCTRACE_SEL_FIELD_BITS                       (1)

#define FPEC_CLKREQ                                          *((volatile int32u *)0x4000402Cu)
#define FPEC_CLKREQ_REG                                      *((volatile int32u *)0x4000402Cu)
#define FPEC_CLKREQ_ADDR                                     (0x4000402Cu)
#define FPEC_CLKREQ_RESET                                    (0x00000000u)
        /* FPEC_CLKREQ_FIELD field */
        #define FPEC_CLKREQ_FIELD                            (0x00000001u)
        #define FPEC_CLKREQ_FIELD_MASK                       (0x00000001u)
        #define FPEC_CLKREQ_FIELD_BIT                        (0)
        #define FPEC_CLKREQ_FIELD_BITS                       (1)

#define FPEC_CLKSTAT                                         *((volatile int32u *)0x40004030u)
#define FPEC_CLKSTAT_REG                                     *((volatile int32u *)0x40004030u)
#define FPEC_CLKSTAT_ADDR                                    (0x40004030u)
#define FPEC_CLKSTAT_RESET                                   (0x00000000u)
        /* FPEC_CLKBSY field */
        #define FPEC_CLKBSY                                  (0x00000002u)
        #define FPEC_CLKBSY_MASK                             (0x00000002u)
        #define FPEC_CLKBSY_BIT                              (1)
        #define FPEC_CLKBSY_BITS                             (1)
        /* FPEC_CLKACK field */
        #define FPEC_CLKACK                                  (0x00000001u)
        #define FPEC_CLKACK_MASK                             (0x00000001u)
        #define FPEC_CLKACK_BIT                              (0)
        #define FPEC_CLKACK_BITS                             (1)

#define LV_SPARE                                             *((volatile int32u *)0x40004034u)
#define LV_SPARE_REG                                         *((volatile int32u *)0x40004034u)
#define LV_SPARE_ADDR                                        (0x40004034u)
#define LV_SPARE_RESET                                       (0x00000000u)
        /* LV_SPARE field */
        #define LV_SPARE_LV_SPARE                            (0x000000FFu)
        #define LV_SPARE_LV_SPARE_MASK                       (0x000000FFu)
        #define LV_SPARE_LV_SPARE_BIT                        (0)
        #define LV_SPARE_LV_SPARE_BITS                       (8)

