contiki-os/contiki/cpu/stm32w108/hal/micro/cortexm3/stm32w108/regs.h
/* RAM_CTRL block */
#define DATA_RAM_CTRL_BASE                                   (0x40005000u)
#define DATA_RAM_CTRL_END                                    (0x40005028u)
#define DATA_RAM_CTRL_SIZE                                   (DATA_RAM_CTRL_END - DATA_RAM_CTRL_BASE + 1)

#define MEM_PROT_0                                           *((volatile int32u *)0x40005000u)
#define MEM_PROT_0_REG                                       *((volatile int32u *)0x40005000u)
#define MEM_PROT_0_ADDR                                      (0x40005000u)
#define MEM_PROT_0_RESET                                     (0x00000000u)
        /* MEM_PROT_0 field */
        #define MEM_PROT_0_MEM_PROT_0                        (0xFFFFFFFFu)
        #define MEM_PROT_0_MEM_PROT_0_MASK                   (0xFFFFFFFFu)
        #define MEM_PROT_0_MEM_PROT_0_BIT                    (0)
        #define MEM_PROT_0_MEM_PROT_0_BITS                   (32)

#define MEM_PROT_1                                           *((volatile int32u *)0x40005004u)
#define MEM_PROT_1_REG                                       *((volatile int32u *)0x40005004u)
#define MEM_PROT_1_ADDR                                      (0x40005004u)
#define MEM_PROT_1_RESET                                     (0x00000000u)
        /* MEM_PROT_1 field */
        #define MEM_PROT_1_MEM_PROT_1                        (0xFFFFFFFFu)
        #define MEM_PROT_1_MEM_PROT_1_MASK                   (0xFFFFFFFFu)
        #define MEM_PROT_1_MEM_PROT_1_BIT                    (0)
        #define MEM_PROT_1_MEM_PROT_1_BITS                   (32)

#define MEM_PROT_2                                           *((volatile int32u *)0x40005008u)
#define MEM_PROT_2_REG                                       *((volatile int32u *)0x40005008u)
#define MEM_PROT_2_ADDR                                      (0x40005008u)
#define MEM_PROT_2_RESET                                     (0x00000000u)
        /* MEM_PROT_2 field */
        #define MEM_PROT_2_MEM_PROT_2                        (0xFFFFFFFFu)
        #define MEM_PROT_2_MEM_PROT_2_MASK                   (0xFFFFFFFFu)
        #define MEM_PROT_2_MEM_PROT_2_BIT                    (0)
        #define MEM_PROT_2_MEM_PROT_2_BITS                   (32)

#define MEM_PROT_3                                           *((volatile int32u *)0x4000500Cu)
#define MEM_PROT_3_REG                                       *((volatile int32u *)0x4000500Cu)
#define MEM_PROT_3_ADDR                                      (0x4000500Cu)
#define MEM_PROT_3_RESET                                     (0x00000000u)
        /* MEM_PROT_3 field */
        #define MEM_PROT_3_MEM_PROT_3                        (0xFFFFFFFFu)
        #define MEM_PROT_3_MEM_PROT_3_MASK                   (0xFFFFFFFFu)
        #define MEM_PROT_3_MEM_PROT_3_BIT                    (0)
        #define MEM_PROT_3_MEM_PROT_3_BITS                   (32)

#define MEM_PROT_4                                           *((volatile int32u *)0x40005010u)
#define MEM_PROT_4_REG                                       *((volatile int32u *)0x40005010u)
#define MEM_PROT_4_ADDR                                      (0x40005010u)
#define MEM_PROT_4_RESET                                     (0x00000000u)
        /* MEM_PROT_4 field */
        #define MEM_PROT_4_MEM_PROT_4                        (0xFFFFFFFFu)
        #define MEM_PROT_4_MEM_PROT_4_MASK                   (0xFFFFFFFFu)
        #define MEM_PROT_4_MEM_PROT_4_BIT                    (0)
        #define MEM_PROT_4_MEM_PROT_4_BITS                   (32)

#define MEM_PROT_5                                           *((volatile int32u *)0x40005014u)
#define MEM_PROT_5_REG                                       *((volatile int32u *)0x40005014u)
#define MEM_PROT_5_ADDR                                      (0x40005014u)
#define MEM_PROT_5_RESET                                     (0x00000000u)
        /* MEM_PROT_5 field */
        #define MEM_PROT_5_MEM_PROT_5                        (0xFFFFFFFFu)
        #define MEM_PROT_5_MEM_PROT_5_MASK                   (0xFFFFFFFFu)
        #define MEM_PROT_5_MEM_PROT_5_BIT                    (0)
        #define MEM_PROT_5_MEM_PROT_5_BITS                   (32)

#define MEM_PROT_6                                           *((volatile int32u *)0x40005018u)
#define MEM_PROT_6_REG                                       *((volatile int32u *)0x40005018u)
#define MEM_PROT_6_ADDR                                      (0x40005018u)
#define MEM_PROT_6_RESET                                     (0x00000000u)
        /* MEM_PROT_6 field */
        #define MEM_PROT_6_MEM_PROT_6                        (0xFFFFFFFFu)
        #define MEM_PROT_6_MEM_PROT_6_MASK                   (0xFFFFFFFFu)
        #define MEM_PROT_6_MEM_PROT_6_BIT                    (0)
        #define MEM_PROT_6_MEM_PROT_6_BITS                   (32)

#define MEM_PROT_7                                           *((volatile int32u *)0x4000501Cu)
#define MEM_PROT_7_REG                                       *((volatile int32u *)0x4000501Cu)
#define MEM_PROT_7_ADDR                                      (0x4000501Cu)
#define MEM_PROT_7_RESET                                     (0x00000000u)
        /* MEM_PROT_7 field */
        #define MEM_PROT_7_MEM_PROT_7                        (0xFFFFFFFFu)
        #define MEM_PROT_7_MEM_PROT_7_MASK                   (0xFFFFFFFFu)
        #define MEM_PROT_7_MEM_PROT_7_BIT                    (0)
        #define MEM_PROT_7_MEM_PROT_7_BITS                   (32)

#define DMA_PROT_ADDR                                        *((volatile int32u *)0x40005020u)
#define DMA_PROT_ADDR_REG                                    *((volatile int32u *)0x40005020u)
#define DMA_PROT_ADDR_ADDR                                   (0x40005020u)
#define DMA_PROT_ADDR_RESET                                  (0x20000000u)
        /* DMA_PROT_OFFS field */
        #define DMA_PROT_ADDR_DMA_PROT_OFFS                  (0xFFFFE000u)
        #define DMA_PROT_ADDR_DMA_PROT_OFFS_MASK             (0xFFFFE000u)
        #define DMA_PROT_ADDR_DMA_PROT_OFFS_BIT              (13)
        #define DMA_PROT_ADDR_DMA_PROT_OFFS_BITS             (19)
        /* DMA_PROT_ADDR field */
        #define DMA_PROT_ADDR_DMA_PROT_ADDR                  (0x00001FFFu)
        #define DMA_PROT_ADDR_DMA_PROT_ADDR_MASK             (0x00001FFFu)
        #define DMA_PROT_ADDR_DMA_PROT_ADDR_BIT              (0)
        #define DMA_PROT_ADDR_DMA_PROT_ADDR_BITS             (13)

#define DMA_PROT_CH                                          *((volatile int32u *)0x40005024u)
#define DMA_PROT_CH_REG                                      *((volatile int32u *)0x40005024u)
#define DMA_PROT_CH_ADDR                                     (0x40005024u)
#define DMA_PROT_CH_RESET                                    (0x00000000u)
        /* DMA_PROT_CH field */
        #define DMA_PROT_CH_DMA_PROT_CH                      (0x00000007u)
        #define DMA_PROT_CH_DMA_PROT_CH_MASK                 (0x00000007u)
        #define DMA_PROT_CH_DMA_PROT_CH_BIT                  (0)
        #define DMA_PROT_CH_DMA_PROT_CH_BITS                 (3)

#define MEM_PROT_EN                                          *((volatile int32u *)0x40005028u)
#define MEM_PROT_EN_REG                                      *((volatile int32u *)0x40005028u)
#define MEM_PROT_EN_ADDR                                     (0x40005028u)
#define MEM_PROT_EN_RESET                                    (0x00000000u)
        /* FORCE_PROT field */
        #define MEM_PROT_EN_FORCE_PROT                       (0x00000004u)
        #define MEM_PROT_EN_FORCE_PROT_MASK                  (0x00000004u)
        #define MEM_PROT_EN_FORCE_PROT_BIT                   (2)
        #define MEM_PROT_EN_FORCE_PROT_BITS                  (1)
        /* DMA_PROT_EN_MAC field */
        #define MEM_PROT_EN_DMA_PROT_EN_MAC                  (0x00000002u)
        #define MEM_PROT_EN_DMA_PROT_EN_MAC_MASK             (0x00000002u)
        #define MEM_PROT_EN_DMA_PROT_EN_MAC_BIT              (1)
        #define MEM_PROT_EN_DMA_PROT_EN_MAC_BITS             (1)
        /* DMA_PROT_EN_OTHER field */
        #define MEM_PROT_EN_DMA_PROT_EN_OTHER                (0x00000001u)
        #define MEM_PROT_EN_DMA_PROT_EN_OTHER_MASK           (0x00000001u)
        #define MEM_PROT_EN_DMA_PROT_EN_OTHER_BIT            (0)
        #define MEM_PROT_EN_DMA_PROT_EN_OTHER_BITS           (1)

/* SLOW_TIMERS block */
#define DATA_SLOW_TIMERS_BASE                                (0x40006000u)
#define DATA_SLOW_TIMERS_END                                 (0x40006024u)
#define DATA_SLOW_TIMERS_SIZE                                (DATA_SLOW_TIMERS_END - DATA_SLOW_TIMERS_BASE + 1)

#define WDOG_CFG                                             *((volatile int32u *)0x40006000u)
#define WDOG_CFG_REG                                         *((volatile int32u *)0x40006000u)
#define WDOG_CFG_ADDR                                        (0x40006000u)
#define WDOG_CFG_RESET                                       (0x00000002u)
        /* WDOG_DISABLE field */
        #define WDOG_DISABLE                                 (0x00000002u)
        #define WDOG_DISABLE_MASK                            (0x00000002u)
        #define WDOG_DISABLE_BIT                             (1)
        #define WDOG_DISABLE_BITS                            (1)
        /* WDOG_ENABLE field */
        #define WDOG_ENABLE                                  (0x00000001u)
        #define WDOG_ENABLE_MASK                             (0x00000001u)
        #define WDOG_ENABLE_BIT                              (0)
        #define WDOG_ENABLE_BITS                             (1)

