contiki-os/contiki/cpu/stm32w108/hal/micro/cortexm3/stm32w108/regs.h
#define ITM_SP16                                             *((volatile int32u *)0xE0000040u)
#define ITM_SP16_REG                                         *((volatile int32u *)0xE0000040u)
#define ITM_SP16_ADDR                                        (0xE0000040u)
#define ITM_SP16_RESET                                       (0x00000000u)
        /* FIFOREADY field */
        #define ITM_SP16_FIFOREADY                           (0x00000001u)
        #define ITM_SP16_FIFOREADY_MASK                      (0x00000001u)
        #define ITM_SP16_FIFOREADY_BIT                       (0)
        #define ITM_SP16_FIFOREADY_BITS                      (1)
        /* STIMULUS field */
        #define ITM_SP16_STIMULUS                            (0xFFFFFFFFu)
        #define ITM_SP16_STIMULUS_MASK                       (0xFFFFFFFFu)
        #define ITM_SP16_STIMULUS_BIT                        (0)
        #define ITM_SP16_STIMULUS_BITS                       (32)

#define ITM_SP17                                             *((volatile int32u *)0xE0000044u)
#define ITM_SP17_REG                                         *((volatile int32u *)0xE0000044u)
#define ITM_SP17_ADDR                                        (0xE0000044u)
#define ITM_SP17_RESET                                       (0x00000000u)
        /* FIFOREADY field */
        #define ITM_SP17_FIFOREADY                           (0x00000001u)
        #define ITM_SP17_FIFOREADY_MASK                      (0x00000001u)
        #define ITM_SP17_FIFOREADY_BIT                       (0)
        #define ITM_SP17_FIFOREADY_BITS                      (1)
        /* STIMULUS field */
        #define ITM_SP17_STIMULUS                            (0xFFFFFFFFu)
        #define ITM_SP17_STIMULUS_MASK                       (0xFFFFFFFFu)
        #define ITM_SP17_STIMULUS_BIT                        (0)
        #define ITM_SP17_STIMULUS_BITS                       (32)

#define ITM_SP18                                             *((volatile int32u *)0xE0000048u)
#define ITM_SP18_REG                                         *((volatile int32u *)0xE0000048u)
#define ITM_SP18_ADDR                                        (0xE0000048u)
#define ITM_SP18_RESET                                       (0x00000000u)
        /* FIFOREADY field */
        #define ITM_SP18_FIFOREADY                           (0x00000001u)
        #define ITM_SP18_FIFOREADY_MASK                      (0x00000001u)
        #define ITM_SP18_FIFOREADY_BIT                       (0)
        #define ITM_SP18_FIFOREADY_BITS                      (1)
        /* STIMULUS field */
        #define ITM_SP18_STIMULUS                            (0xFFFFFFFFu)
        #define ITM_SP18_STIMULUS_MASK                       (0xFFFFFFFFu)
        #define ITM_SP18_STIMULUS_BIT                        (0)
        #define ITM_SP18_STIMULUS_BITS                       (32)

#define ITM_SP19                                             *((volatile int32u *)0xE000004Cu)
#define ITM_SP19_REG                                         *((volatile int32u *)0xE000004Cu)
#define ITM_SP19_ADDR                                        (0xE000004Cu)
#define ITM_SP19_RESET                                       (0x00000000u)
        /* FIFOREADY field */
        #define ITM_SP19_FIFOREADY                           (0x00000001u)
        #define ITM_SP19_FIFOREADY_MASK                      (0x00000001u)
        #define ITM_SP19_FIFOREADY_BIT                       (0)
        #define ITM_SP19_FIFOREADY_BITS                      (1)
        /* STIMULUS field */
        #define ITM_SP19_STIMULUS                            (0xFFFFFFFFu)
        #define ITM_SP19_STIMULUS_MASK                       (0xFFFFFFFFu)
        #define ITM_SP19_STIMULUS_BIT                        (0)
        #define ITM_SP19_STIMULUS_BITS                       (32)

#define ITM_SP20                                             *((volatile int32u *)0xE0000050u)
#define ITM_SP20_REG                                         *((volatile int32u *)0xE0000050u)
#define ITM_SP20_ADDR                                        (0xE0000050u)
#define ITM_SP20_RESET                                       (0x00000000u)
        /* FIFOREADY field */
        #define ITM_SP20_FIFOREADY                           (0x00000001u)
        #define ITM_SP20_FIFOREADY_MASK                      (0x00000001u)
        #define ITM_SP20_FIFOREADY_BIT                       (0)
        #define ITM_SP20_FIFOREADY_BITS                      (1)
        /* STIMULUS field */
        #define ITM_SP20_STIMULUS                            (0xFFFFFFFFu)
        #define ITM_SP20_STIMULUS_MASK                       (0xFFFFFFFFu)
        #define ITM_SP20_STIMULUS_BIT                        (0)
        #define ITM_SP20_STIMULUS_BITS                       (32)

#define ITM_SP21                                             *((volatile int32u *)0xE0000054u)
#define ITM_SP21_REG                                         *((volatile int32u *)0xE0000054u)
#define ITM_SP21_ADDR                                        (0xE0000054u)
#define ITM_SP21_RESET                                       (0x00000000u)
        /* FIFOREADY field */
        #define ITM_SP21_FIFOREADY                           (0x00000001u)
        #define ITM_SP21_FIFOREADY_MASK                      (0x00000001u)
        #define ITM_SP21_FIFOREADY_BIT                       (0)
        #define ITM_SP21_FIFOREADY_BITS                      (1)
        /* STIMULUS field */
        #define ITM_SP21_STIMULUS                            (0xFFFFFFFFu)
        #define ITM_SP21_STIMULUS_MASK                       (0xFFFFFFFFu)
        #define ITM_SP21_STIMULUS_BIT                        (0)
        #define ITM_SP21_STIMULUS_BITS                       (32)

#define ITM_SP22                                             *((volatile int32u *)0xE0000058u)
#define ITM_SP22_REG                                         *((volatile int32u *)0xE0000058u)
#define ITM_SP22_ADDR                                        (0xE0000058u)
#define ITM_SP22_RESET                                       (0x00000000u)
        /* FIFOREADY field */
        #define ITM_SP22_FIFOREADY                           (0x00000001u)
        #define ITM_SP22_FIFOREADY_MASK                      (0x00000001u)
        #define ITM_SP22_FIFOREADY_BIT                       (0)
        #define ITM_SP22_FIFOREADY_BITS                      (1)
        /* STIMULUS field */
        #define ITM_SP22_STIMULUS                            (0xFFFFFFFFu)
        #define ITM_SP22_STIMULUS_MASK                       (0xFFFFFFFFu)
        #define ITM_SP22_STIMULUS_BIT                        (0)
        #define ITM_SP22_STIMULUS_BITS                       (32)

#define ITM_SP23                                             *((volatile int32u *)0xE000005Cu)
#define ITM_SP23_REG                                         *((volatile int32u *)0xE000005Cu)
#define ITM_SP23_ADDR                                        (0xE000005Cu)
#define ITM_SP23_RESET                                       (0x00000000u)
        /* FIFOREADY field */
        #define ITM_SP23_FIFOREADY                           (0x00000001u)
        #define ITM_SP23_FIFOREADY_MASK                      (0x00000001u)
        #define ITM_SP23_FIFOREADY_BIT                       (0)
        #define ITM_SP23_FIFOREADY_BITS                      (1)
        /* STIMULUS field */
        #define ITM_SP23_STIMULUS                            (0xFFFFFFFFu)
        #define ITM_SP23_STIMULUS_MASK                       (0xFFFFFFFFu)
        #define ITM_SP23_STIMULUS_BIT                        (0)
        #define ITM_SP23_STIMULUS_BITS                       (32)

#define ITM_SP24                                             *((volatile int32u *)0xE0000060u)
#define ITM_SP24_REG                                         *((volatile int32u *)0xE0000060u)
#define ITM_SP24_ADDR                                        (0xE0000060u)
#define ITM_SP24_RESET                                       (0x00000000u)
        /* FIFOREADY field */
        #define ITM_SP24_FIFOREADY                           (0x00000001u)
        #define ITM_SP24_FIFOREADY_MASK                      (0x00000001u)
        #define ITM_SP24_FIFOREADY_BIT                       (0)
        #define ITM_SP24_FIFOREADY_BITS                      (1)
        /* STIMULUS field */
        #define ITM_SP24_STIMULUS                            (0xFFFFFFFFu)
        #define ITM_SP24_STIMULUS_MASK                       (0xFFFFFFFFu)
        #define ITM_SP24_STIMULUS_BIT                        (0)
        #define ITM_SP24_STIMULUS_BITS                       (32)

#define ITM_SP25                                             *((volatile int32u *)0xE0000064u)
#define ITM_SP25_REG                                         *((volatile int32u *)0xE0000064u)
#define ITM_SP25_ADDR                                        (0xE0000064u)
#define ITM_SP25_RESET                                       (0x00000000u)
        /* FIFOREADY field */
        #define ITM_SP25_FIFOREADY                           (0x00000001u)
        #define ITM_SP25_FIFOREADY_MASK                      (0x00000001u)
        #define ITM_SP25_FIFOREADY_BIT                       (0)
        #define ITM_SP25_FIFOREADY_BITS                      (1)
        /* STIMULUS field */
        #define ITM_SP25_STIMULUS                            (0xFFFFFFFFu)
        #define ITM_SP25_STIMULUS_MASK                       (0xFFFFFFFFu)
        #define ITM_SP25_STIMULUS_BIT                        (0)
        #define ITM_SP25_STIMULUS_BITS                       (32)

