contiki-os/contiki/cpu/stm32w108/hal/micro/cortexm3/stm32w108/regs.h
#define SCS_BFAR                                             *((volatile int32u *)0xE000ED38u)
#define SCS_BFAR_REG                                         *((volatile int32u *)0xE000ED38u)
#define SCS_BFAR_ADDR                                        (0xE000ED38u)
#define SCS_BFAR_RESET                                       (0x00000000u)
        /* ADDRESS field */
        #define SCS_BFAR_ADDRESS                             (0xFFFFFFFFu)
        #define SCS_BFAR_ADDRESS_MASK                        (0xFFFFFFFFu)
        #define SCS_BFAR_ADDRESS_BIT                         (0)
        #define SCS_BFAR_ADDRESS_BITS                        (32)

#define SCS_AFSR                                             *((volatile int32u *)0xE000ED3Cu)
#define SCS_AFSR_REG                                         *((volatile int32u *)0xE000ED3Cu)
#define SCS_AFSR_ADDR                                        (0xE000ED3Cu)
#define SCS_AFSR_RESET                                       (0x00000000u)
        /* WRONGSIZE field */
        #define SCS_AFSR_WRONGSIZE                           (0x00000008u)
        #define SCS_AFSR_WRONGSIZE_MASK                      (0x00000008u)
        #define SCS_AFSR_WRONGSIZE_BIT                       (3)
        #define SCS_AFSR_WRONGSIZE_BITS                      (1)
        /* PROTECTED field */
        #define SCS_AFSR_PROTECTED                           (0x00000004u)
        #define SCS_AFSR_PROTECTED_MASK                      (0x00000004u)
        #define SCS_AFSR_PROTECTED_BIT                       (2)
        #define SCS_AFSR_PROTECTED_BITS                      (1)
        /* RESERVED field */
        #define SCS_AFSR_RESERVED                            (0x00000002u)
        #define SCS_AFSR_RESERVED_MASK                       (0x00000002u)
        #define SCS_AFSR_RESERVED_BIT                        (1)
        #define SCS_AFSR_RESERVED_BITS                       (1)
        /* MISSED field */
        #define SCS_AFSR_MISSED                              (0x00000001u)
        #define SCS_AFSR_MISSED_MASK                         (0x00000001u)
        #define SCS_AFSR_MISSED_BIT                          (0)
        #define SCS_AFSR_MISSED_BITS                         (1)

#define SCS_PFR0                                             *((volatile int32u *)0xE000ED40u)
#define SCS_PFR0_REG                                         *((volatile int32u *)0xE000ED40u)
#define SCS_PFR0_ADDR                                        (0xE000ED40u)
#define SCS_PFR0_RESET                                       (0x00000030u)
        /* FEATURE field */
        #define SCS_PFR0_FEATURE                             (0xFFFFFFFFu)
        #define SCS_PFR0_FEATURE_MASK                        (0xFFFFFFFFu)
        #define SCS_PFR0_FEATURE_BIT                         (0)
        #define SCS_PFR0_FEATURE_BITS                        (32)

#define SCS_PFR1                                             *((volatile int32u *)0xE000ED44u)
#define SCS_PFR1_REG                                         *((volatile int32u *)0xE000ED44u)
#define SCS_PFR1_ADDR                                        (0xE000ED44u)
#define SCS_PFR1_RESET                                       (0x00000200u)
        /* FEATURE field */
        #define SCS_PFR1_FEATURE                             (0xFFFFFFFFu)
        #define SCS_PFR1_FEATURE_MASK                        (0xFFFFFFFFu)
        #define SCS_PFR1_FEATURE_BIT                         (0)
        #define SCS_PFR1_FEATURE_BITS                        (32)

#define SCS_DFR0                                             *((volatile int32u *)0xE000ED48u)
#define SCS_DFR0_REG                                         *((volatile int32u *)0xE000ED48u)
#define SCS_DFR0_ADDR                                        (0xE000ED48u)
#define SCS_DFR0_RESET                                       (0x00100000u)
        /* FEATURE field */
        #define SCS_DFR0_FEATURE                             (0xFFFFFFFFu)
        #define SCS_DFR0_FEATURE_MASK                        (0xFFFFFFFFu)
        #define SCS_DFR0_FEATURE_BIT                         (0)
        #define SCS_DFR0_FEATURE_BITS                        (32)

#define SCS_AFR0                                             *((volatile int32u *)0xE000ED4Cu)
#define SCS_AFR0_REG                                         *((volatile int32u *)0xE000ED4Cu)
#define SCS_AFR0_ADDR                                        (0xE000ED4Cu)
#define SCS_AFR0_RESET                                       (0x00000000u)
        /* FEATURE field */
        #define SCS_AFR0_FEATURE                             (0xFFFFFFFFu)
        #define SCS_AFR0_FEATURE_MASK                        (0xFFFFFFFFu)
        #define SCS_AFR0_FEATURE_BIT                         (0)
        #define SCS_AFR0_FEATURE_BITS                        (32)

#define SCS_MMFR0                                            *((volatile int32u *)0xE000ED50u)
#define SCS_MMFR0_REG                                        *((volatile int32u *)0xE000ED50u)
#define SCS_MMFR0_ADDR                                       (0xE000ED50u)
#define SCS_MMFR0_RESET                                      (0x00000030u)
        /* FEATURE field */
        #define SCS_MMFR0_FEATURE                            (0xFFFFFFFFu)
        #define SCS_MMFR0_FEATURE_MASK                       (0xFFFFFFFFu)
        #define SCS_MMFR0_FEATURE_BIT                        (0)
        #define SCS_MMFR0_FEATURE_BITS                       (32)

#define SCS_MMFR1                                            *((volatile int32u *)0xE000ED54u)
#define SCS_MMFR1_REG                                        *((volatile int32u *)0xE000ED54u)
#define SCS_MMFR1_ADDR                                       (0xE000ED54u)
#define SCS_MMFR1_RESET                                      (0x00000000u)
        /* FEATURE field */
        #define SCS_MMFR1_FEATURE                            (0xFFFFFFFFu)
        #define SCS_MMFR1_FEATURE_MASK                       (0xFFFFFFFFu)
        #define SCS_MMFR1_FEATURE_BIT                        (0)
        #define SCS_MMFR1_FEATURE_BITS                       (32)

#define SCS_MMFR2                                            *((volatile int32u *)0xE000ED58u)
#define SCS_MMFR2_REG                                        *((volatile int32u *)0xE000ED58u)
#define SCS_MMFR2_ADDR                                       (0xE000ED58u)
#define SCS_MMFR2_RESET                                      (0x00000000u)
        /* FEATURE field */
        #define SCS_MMFR2_FEATURE                            (0xFFFFFFFFu)
        #define SCS_MMFR2_FEATURE_MASK                       (0xFFFFFFFFu)
        #define SCS_MMFR2_FEATURE_BIT                        (0)
        #define SCS_MMFR2_FEATURE_BITS                       (32)

#define SCS_MMFR3                                            *((volatile int32u *)0xE000ED5Cu)
#define SCS_MMFR3_REG                                        *((volatile int32u *)0xE000ED5Cu)
#define SCS_MMFR3_ADDR                                       (0xE000ED5Cu)
#define SCS_MMFR3_RESET                                      (0x00000000u)
        /* FEATURE field */
        #define SCS_MMFR3_FEATURE                            (0xFFFFFFFFu)
        #define SCS_MMFR3_FEATURE_MASK                       (0xFFFFFFFFu)
        #define SCS_MMFR3_FEATURE_BIT                        (0)
        #define SCS_MMFR3_FEATURE_BITS                       (32)

#define SCS_ISAFR0                                           *((volatile int32u *)0xE000ED60u)
#define SCS_ISAFR0_REG                                       *((volatile int32u *)0xE000ED60u)
#define SCS_ISAFR0_ADDR                                      (0xE000ED60u)
#define SCS_ISAFR0_RESET                                     (0x01141110u)
        /* FEATURE field */
        #define SCS_ISAFR0_FEATURE                           (0xFFFFFFFFu)
        #define SCS_ISAFR0_FEATURE_MASK                      (0xFFFFFFFFu)
        #define SCS_ISAFR0_FEATURE_BIT                       (0)
        #define SCS_ISAFR0_FEATURE_BITS                      (32)

#define SCS_ISAFR1                                           *((volatile int32u *)0xE000ED64u)
#define SCS_ISAFR1_REG                                       *((volatile int32u *)0xE000ED64u)
#define SCS_ISAFR1_ADDR                                      (0xE000ED64u)
#define SCS_ISAFR1_RESET                                     (0x02111000u)
        /* FEATURE field */
        #define SCS_ISAFR1_FEATURE                           (0xFFFFFFFFu)
        #define SCS_ISAFR1_FEATURE_MASK                      (0xFFFFFFFFu)
        #define SCS_ISAFR1_FEATURE_BIT                       (0)
        #define SCS_ISAFR1_FEATURE_BITS                      (32)

