contiki-os/contiki/cpu/stm32w108/hal/micro/cortexm3/stm32w108/regs.h
#define NVIC_PCELLID0                                        *((volatile int32u *)0xE000EFF0u)
#define NVIC_PCELLID0_REG                                    *((volatile int32u *)0xE000EFF0u)
#define NVIC_PCELLID0_ADDR                                   (0xE000EFF0u)
#define NVIC_PCELLID0_RESET                                  (0x0000000Du)
        /* PCELLID field */
        #define NVIC_PCELLID0_PCELLID                        (0xFFFFFFFFu)
        #define NVIC_PCELLID0_PCELLID_MASK                   (0xFFFFFFFFu)
        #define NVIC_PCELLID0_PCELLID_BIT                    (0)
        #define NVIC_PCELLID0_PCELLID_BITS                   (32)

#define NVIC_PCELLID1                                        *((volatile int32u *)0xE000EFF4u)
#define NVIC_PCELLID1_REG                                    *((volatile int32u *)0xE000EFF4u)
#define NVIC_PCELLID1_ADDR                                   (0xE000EFF4u)
#define NVIC_PCELLID1_RESET                                  (0x000000E0u)
        /* PCELLID field */
        #define NVIC_PCELLID1_PCELLID                        (0xFFFFFFFFu)
        #define NVIC_PCELLID1_PCELLID_MASK                   (0xFFFFFFFFu)
        #define NVIC_PCELLID1_PCELLID_BIT                    (0)
        #define NVIC_PCELLID1_PCELLID_BITS                   (32)

#define NVIC_PCELLID2                                        *((volatile int32u *)0xE000EFF8u)
#define NVIC_PCELLID2_REG                                    *((volatile int32u *)0xE000EFF8u)
#define NVIC_PCELLID2_ADDR                                   (0xE000EFF8u)
#define NVIC_PCELLID2_RESET                                  (0x00000005u)
        /* PCELLID field */
        #define NVIC_PCELLID2_PCELLID                        (0xFFFFFFFFu)
        #define NVIC_PCELLID2_PCELLID_MASK                   (0xFFFFFFFFu)
        #define NVIC_PCELLID2_PCELLID_BIT                    (0)
        #define NVIC_PCELLID2_PCELLID_BITS                   (32)

#define NVIC_PCELLID3                                        *((volatile int32u *)0xE000EFFCu)
#define NVIC_PCELLID3_REG                                    *((volatile int32u *)0xE000EFFCu)
#define NVIC_PCELLID3_ADDR                                   (0xE000EFFCu)
#define NVIC_PCELLID3_RESET                                  (0x000000B1u)
        /* PCELLID field */
        #define NVIC_PCELLID3_PCELLID                        (0xFFFFFFFFu)
        #define NVIC_PCELLID3_PCELLID_MASK                   (0xFFFFFFFFu)
        #define NVIC_PCELLID3_PCELLID_BIT                    (0)
        #define NVIC_PCELLID3_PCELLID_BITS                   (32)

/* TPIU block */
#define DATA_TPIU_BASE                                       (0xE0040000u)
#define DATA_TPIU_END                                        (0xE0040EF8u)
#define DATA_TPIU_SIZE                                       (DATA_TPIU_END - DATA_TPIU_BASE + 1)

#define TPIU_SPS                                             *((volatile int32u *)0xE0040000u)
#define TPIU_SPS_REG                                         *((volatile int32u *)0xE0040000u)
#define TPIU_SPS_ADDR                                        (0xE0040000u)
#define TPIU_SPS_RESET                                       (0x00000000u)
        /* SPS_04 field */
        #define TPIU_SPS_SPS_04                              (0x00000008u)
        #define TPIU_SPS_SPS_04_MASK                         (0x00000008u)
        #define TPIU_SPS_SPS_04_BIT                          (3)
        #define TPIU_SPS_SPS_04_BITS                         (1)
        /* SPS_03 field */
        #define TPIU_SPS_SPS_03                              (0x00000004u)
        #define TPIU_SPS_SPS_03_MASK                         (0x00000004u)
        #define TPIU_SPS_SPS_03_BIT                          (2)
        #define TPIU_SPS_SPS_03_BITS                         (1)
        /* SPS_02 field */
        #define TPIU_SPS_SPS_02                              (0x00000002u)
        #define TPIU_SPS_SPS_02_MASK                         (0x00000002u)
        #define TPIU_SPS_SPS_02_BIT                          (1)
        #define TPIU_SPS_SPS_02_BITS                         (1)
        /* SPS_01 field */
        #define TPIU_SPS_SPS_01                              (0x00000001u)
        #define TPIU_SPS_SPS_01_MASK                         (0x00000001u)
        #define TPIU_SPS_SPS_01_BIT                          (0)
        #define TPIU_SPS_SPS_01_BITS                         (1)

#define TPIU_CPS                                             *((volatile int32u *)0xE0040004u)
#define TPIU_CPS_REG                                         *((volatile int32u *)0xE0040004u)
#define TPIU_CPS_ADDR                                        (0xE0040004u)
#define TPIU_CPS_RESET                                       (0x00000001u)
        /* CPS_04 field */
        #define TPIU_CPS_CPS_04                              (0x00000008u)
        #define TPIU_CPS_CPS_04_MASK                         (0x00000008u)
        #define TPIU_CPS_CPS_04_BIT                          (3)
        #define TPIU_CPS_CPS_04_BITS                         (1)
        /* CPS_03 field */
        #define TPIU_CPS_CPS_03                              (0x00000004u)
        #define TPIU_CPS_CPS_03_MASK                         (0x00000004u)
        #define TPIU_CPS_CPS_03_BIT                          (2)
        #define TPIU_CPS_CPS_03_BITS                         (1)
        /* CPS_02 field */
        #define TPIU_CPS_CPS_02                              (0x00000002u)
        #define TPIU_CPS_CPS_02_MASK                         (0x00000002u)
        #define TPIU_CPS_CPS_02_BIT                          (1)
        #define TPIU_CPS_CPS_02_BITS                         (1)
        /* CPS_01 field */
        #define TPIU_CPS_CPS_01                              (0x00000001u)
        #define TPIU_CPS_CPS_01_MASK                         (0x00000001u)
        #define TPIU_CPS_CPS_01_BIT                          (0)
        #define TPIU_CPS_CPS_01_BITS                         (1)

#define TPIU_COSD                                            *((volatile int32u *)0xE0040010u)
#define TPIU_COSD_REG                                        *((volatile int32u *)0xE0040010u)
#define TPIU_COSD_ADDR                                       (0xE0040010u)
#define TPIU_COSD_RESET                                      (0x00000000u)
        /* PRESCALER field */
        #define TPIU_COSD_PRESCALER                          (0x00001FFFu)
        #define TPIU_COSD_PRESCALER_MASK                     (0x00001FFFu)
        #define TPIU_COSD_PRESCALER_BIT                      (0)
        #define TPIU_COSD_PRESCALER_BITS                     (13)

#define TPIU_SPP                                             *((volatile int32u *)0xE00400F0u)
#define TPIU_SPP_REG                                         *((volatile int32u *)0xE00400F0u)
#define TPIU_SPP_ADDR                                        (0xE00400F0u)
#define TPIU_SPP_RESET                                       (0x00000001u)
        /* PROTOCOL field */
        #define TPIU_SPP_PROTOCOL                            (0x00000003u)
        #define TPIU_SPP_PROTOCOL_MASK                       (0x00000003u)
        #define TPIU_SPP_PROTOCOL_BIT                        (0)
        #define TPIU_SPP_PROTOCOL_BITS                       (2)

#define TPIU_FFS                                             *((volatile int32u *)0xE0040300u)
#define TPIU_FFS_REG                                         *((volatile int32u *)0xE0040300u)
#define TPIU_FFS_ADDR                                        (0xE0040300u)
#define TPIU_FFS_RESET                                       (0x00000008u)
        /* FTNONSTOP field */
        #define TPIU_FFS_FTNONSTOP                           (0x00000008u)
        #define TPIU_FFS_FTNONSTOP_MASK                      (0x00000008u)
        #define TPIU_FFS_FTNONSTOP_BIT                       (3)
        #define TPIU_FFS_FTNONSTOP_BITS                      (1)
        /* TCPRESENT field */
        #define TPIU_FFS_TCPRESENT                           (0x00000004u)
        #define TPIU_FFS_TCPRESENT_MASK                      (0x00000004u)
        #define TPIU_FFS_TCPRESENT_BIT                       (2)
        #define TPIU_FFS_TCPRESENT_BITS                      (1)
        /* FTSTOPPED field */
        #define TPIU_FFS_FTSTOPPED                           (0x00000002u)
        #define TPIU_FFS_FTSTOPPED_MASK                      (0x00000002u)
        #define TPIU_FFS_FTSTOPPED_BIT                       (1)
        #define TPIU_FFS_FTSTOPPED_BITS                      (1)
        /* FLINPROG field */
        #define TPIU_FFS_FLINPROG                            (0x00000001u)
        #define TPIU_FFS_FLINPROG_MASK                       (0x00000001u)
        #define TPIU_FFS_FLINPROG_BIT                        (0)
        #define TPIU_FFS_FLINPROG_BITS                       (1)

